[
    [
        {
            "name": "Abacavir + Lamivudine + Zidovudine",
            "link": "https://medex.com.bd/generics/24/abacavir-lamivudine-zidovudine",
            "Indications": "This is indicated in combination with other antiretrovirals or alone for the treatment of human immunodeficiency virus type 1 (HIV-1) infection.",
            "Pharmacology": "Abacavir is a carbocyclic synthetic nucleoside analogue and an antiviral agent. Intracellularly, abacavir is converted by cellular enzymes to the active metabolite carbovir triphosphate, an analogue of deoxyguanosine-5'-triphosphate (dGTP). Carbovir triphosphate inhibits the activity of HIV-1 reverse transcriptase (RT) both by competing with the natural substrate dGTP and by its incorporation into viral DNA. Viral DNA growth is terminated because the incorporated nucleotide lacks a 3'-OH group, which is needed to form the 5′ to 3′ phosphodiester linkage essential for DNA chain elongation.Lamivudine is a synthetic nucleoside analogue and is phosphorylated intracellularly to its active 5'-triphosphate metabolite, lamivudine triphosphate (L-TP). This nucleoside analogue is incorporated into viral DNA by HIV reverse transcriptase and HBV polymerase, resulting in DNA chain termination.Zidovudine, a structural analog of thymidine, is a prodrug that must be phosphorylated to its active 5′-triphosphate metabolite, zidovudine triphosphate (ZDV-TP). It inhibits the activity of HIV-1 reverse transcriptase (RT) via DNA chain termination after incorporation of the nucleotide analogue. It competes with the natural substrate dGTP and incorporates itself into viral DNA. It is also a weak inhibitor of cellular DNA polymerase α and γ.",
            "Dosage & Administration": "Recommended dosage for adults and pediatric patients weighing at least 40 kg: The recommended dosage is one tablet taken orally twice daily with or without food. Due to fixed-dose tablet and cannot be dose adjusted, this is not recommended for:\n\nPediatric patients who weigh less than 40 kg.\nPatients with creatinine clearance less than 50 ml/minute\nPatients with mild hepatic impairment.",
            "Interaction": "Abacavir: In a trial of 11 HIV-1-infected subjects receiving methadone-maintenance therapy with 600 mg twice daily (twice the currently recommended dose), oral methadone clearance increased. This alteration will not result in a methadone dose modification in the majority of patients; however, an increased methadone dose may be required in a small number of patients.Lamivudine: Coadministration of single doses of lamivudine and sorbitol resulted in a sorbitol dose-dependent reduction in lamivudine exposures. When possible, avoid use of sorbitol-containing medicines with lamivudine-containing medicinesZidovudine: Concomitant use of zidovudine with the following drugs should be avoided since an antagonistic relationship has been demonstrated in vitro: Stavudine, Doxorubicin, Nucleoside analogues, e.g., ribavirin",
            "Contraindications": "This is contraindicated in patients:\n\nWho have the HLA-B*5701 allele\nWith prior hypersensitivity reaction to abacavir, lamivudine, or zidovudine.\nWith moderate or severe hepatic impairment.",
            "Side Effects": "The most commonly reported adverse reactions (incidence at least 10%) in clinical trials were nausea, headache, malaise and fatigue, and nausea and vomiting.",
            "Pregnancy & Lactation": "Pregnancy Category C. There are no adequate and well-controlled studies of this preparation in pregnant women. This drug should be used during pregnancy only if the potential benefits outweigh the risks. Women infected with HIV should be instructed not to breastfeed due to potential for HIV transmission.",
            "Precautions & Warnings": "Serious and sometimes fatal hypersensitivity reactions have occurred with abacavir, a component of this preparation. These hypersensitivity reactions have included multi-organ failure and anaphylaxis and typically occurred within the first 6 weeks of treatment with abacavir (median time to onset was 9 days); although abacavir hypersensitivity reactions have occurred any time during. Patients who carry the HLA-B*5701 allele are at a higher risk of abacavir hypersensitivity reactions; although, patients who do not carry the HLA-B*5701 allele have developed hypersensitivity reactions. Hypersensitivity to abacavir was reported in approximately 206 (8%) of 2,670 patients in 9 clinical trials with abacavir-containing products where HLA-B*5701 screening was not performed. The incidence of suspected abacavir hypersensitivity reactions in clinical trials was 1% when subjects carrying the HLA-B*5701 allele were excluded. In any patient treated with abacavir, the clinical diagnosis of hypersensitivity reaction must remain the basis of clinical decision making.",
            "Overdose Effects": "There is no known specific treatment for overdose with this preparation. If overdose occurs, the patient should be monitored and standard supportive treatment applied as required.",
            "Therapeutic Class": "Drugs for HIV / Anti-retroviral drugs",
            "Storage Conditions": "Store at a dry and cool place. Protect from light and moisture. Keep the medicine out of the reach of children."
        },
        {
            "name": "Abemaciclib",
            "link": "https://medex.com.bd/generics/2043/abemaciclib",
            "Indications": "Abemaciclib is a kinase inhibitor indicated:\n\nin combination with endocrine therapy (tamoxifen or an aromatase inhibitor) for the adjuvant treatment of adult patients with hormone receptor (HR)-positive, human epidermal growth factor receptor 2 (HER2)-negative, node-positive, early breast cancer at high risk of recurrence and a Ki-67 score ≥20% as determined by an FDA approved test. ... Read moreAbemaciclib is a kinase inhibitor indicated:\n\nin combination with endocrine therapy (tamoxifen or an aromatase inhibitor) for the adjuvant treatment of adult patients with hormone receptor (HR)-positive, human epidermal growth factor receptor 2 (HER2)-negative, node-positive, early breast cancer at high risk of recurrence and a Ki-67 score ≥20% as determined by an FDA approved test.\nin combination with an aromatase inhibitor as initial endocrine-based therapy for the treatment of postmenopausal women, and men, with hormone receptor (HR)-positive, human epidermal growth factor receptor 2 (HER2)-negative advanced or metastatic breast cancer.\nin combination with fulvestrant for the treatment of adult patients with hormone receptor (HR)-positive, human epidermal growth factor receptor 2 (HER2)-negative advanced or metastatic breast cancer with disease progression following endocrine therapy.\nas monotherapy for the treatment of adult patients with HR-positive, HER2-negative advanced or metastatic breast cancer with disease progression following endocrine therapy and prior chemotherapy in the metastatic setting.",
            "Pharmacology": "Abemaciclib is an inhibitor of cyclin-dependent kinases 4 and 6 (CDK4 and CDK6). These kinases are activated upon binding to D-cyclins. In estrogen receptor-positive (ER+) breast cancer cell lines, cyclin D1 and CDK4/6 promote phosphorylation of the retinoblastoma protein (Rb), cell cycle progression, and cell proliferation. In vitro, continuous exposure to abemaciclib inhibited Rb phosphorylation and blocked progression from G1 into S phase of the cell cycle, resulting in senescence and apoptosis. In breast cancer xenograft models, abemaciclib dosed daily without interruption as a single agent or in combination with antiestrogens resulted in reduction of tumor size.",
            "Dosage & Administration": "Abemaciclib tablets are taken orally with or without food.\n\nRecommended starting dose in combination with fulvestrant, tamoxifen, or an aromatase inhibitor: 150 mg twice daily.\nRecommended starting dose as monotherapy: 200 mg twice daily.\nDosing interruption and/or dose reductions may be required based on individual safety and tolerability.",
            "Interaction": "CYP3A Inhibitors: Avoid concomitant use of ketoconazole. Reduce the Abemaciclib dose with concomitant use of other strong and moderate CYP3A inhibitors.CYP3A Inducers: Avoid concomitant use of strong and moderate CYP3A inducers.",
            "Side Effects": "Most common adverse reactions (incidence ≥20%) were diarrhea, neutropenia, nausea, abdominal pain, infections, fatigue, anemia, leukopenia, decreased appetite, vomiting, headache, alopecia, and thrombocytopenia.",
            "Pregnancy & Lactation": "Based on findings from animal studies and the mechanism of action, Abemaciclib can cause fetal harm when administered to a pregnant woman. In animal reproduction studies, administration of abemaciclib to pregnant rats during the period of organogenesis caused teratogenicity and decreased fetal weight at maternal exposures that were similar to the human clinical exposure based on area under the curve (AUC) at the maximum recommended human dose. Advise pregnant women of the potential risk to a fetus. Advise females of reproductive potential to use effective contraception during treatment with Abemaciclib and for 3 weeks after the last dose.",
            "Precautions & Warnings": "Diarrhea: Abemaciclib can cause severe cases of diarrhea, associated with dehydration and infection. Instruct patients at the first sign of loose stools to initiate antidiarrheal therapy, increase oral fluids, and notify their healthcare provider.Neutropenia: Monitor complete blood counts prior to the start of Abemaciclib therapy, every 2 weeks for the first 2 months, monthly for the next 2 months, and as clinically indicated.Interstitial Lung Disease (ILD)/Pneumonitis: Severe and fatal cases of ILD/pneumonitis have been reported. Monitor for clinical symptoms or radiological changes indicative of ILD/pneumonitis. Permanently discontinue Abemaciclib in all patients with Grade 3 or 4 ILD or pneumonitis.Hepatotoxicity: Increases in serum transaminase levels have been observed. Perform liver function tests (LFTs) before initiating treatment with Abemaciclib. Monitor LFTs every two weeks for the first two months, monthly for the next 2 months, and as clinically indicated.Venous Thromboembolism: Monitor patients for signs and symptoms of thrombosis and pulmonary embolism and treat as medically appropriate.Embryo-Fetal Toxicity: Can cause fetal harm. Advise patients of potential",
            "Use in Special Populations": "Pediatric Use: The safety and effectiveness of Abemaciclib have not been established in pediatric patients.Geriatric Use: No overall differences in safety or effectiveness of Abemaciclib were observed between these patients and younger patients.Renal Impairment: No dosage adjustment is required for patients with mild or moderate renal impairment.Hepatic Impairment: No dosage adjustments are necessary in patients with mild or moderate hepatic impairment",
            "Therapeutic Class": "Protein kinase inhibitor",
            "Storage Conditions": "Keep below 30°C temperature, away from light & moisture. Keep out of the reach of children."
        },
        {
            "name": "Abiraterone Acetate",
            "link": "https://medex.com.bd/generics/1294/abiraterone-acetate",
            "Indications": "Abiraterone Acetate is a CYP17 inhibitor indicated in combination with prednisone for the treatment of patients with\n\nMetastatic castration-resistant prostate cancer (CRPC).\nMetastatic high-risk castration-sensitive prostate cancer (CSPC).",
            "Pharmacology": "Abiraterone is an orally active inhibitor of the steroidal enzyme CYP17A1 (17 alpha-hydroxylase/C17,20 lyase). It inhibits CYP17A1 in a selective and irreversible manner via covalent binding mechanism. CYP17A1 is an enzyme that catalyzes the biosynthesis of androgen and is highly expressed in testicular, adrenal, and prostatic tumor tissue. More specifically, abiraterone inhibits the conversion of 17-hydroxyprognenolone to dehydroepiandrosterone (DHEA) by the enzyme CYP17A1 to decrease serum levels of testosterone and other androgens.",
            "Dosage & Administration": "Metastatic castration-resistant prostate cancer: Abiraterone 1,000 mg orally once daily with prednisone 5 mg orally twice daily.Metastatic castration-sensitive prostate cancer: Abiraterone 1,000 mg orally once daily with prednisone 5 mg orally once daily.Patients receiving Abiraterone should also receive a gonadotropin-releasing hormone (GnRH) analog concurrently or should have had bilateral orchiectomy. Abiraterone must be taken on an empty stomach with water at least 1 hour before or 2 hours after a meal. Do not crush or chew tablets.Dose Modification:\n\nFor patients with baseline moderate hepatic impairment (Child-Pugh Class B), reduce the Abiraterone starting dose to 250 mg once daily.\nFor patients who develop hepatotoxicity during treatment, hold Abiraterone until recovery. Retreatment may be initiated at a reduced dose. Abiraterone should be discontinued if patients develop severe hepatotoxicity.",
            "Interaction": "CYP3A4 Inducers: Avoid concomitant strong CYP3A4 inducers during Abiraterone treatment. If a strong CYP3A4 inducer must be co-administered, increase the Abiraterone dosing frequency.CYP2D6 Substrates: Avoid co-administration of Abiraterone with CYP2D6 substrates that have a narrow therapeutic index. If an alternative treatment cannot be used, exercise caution and consider a dose reduction of the concomitant CYP2D6 substrate.",
            "Contraindications": "Hypersensitivity to the Abiraterone acetate or to any of the excipients of Abiraterone.",
            "Side Effects": "The most common adverse reactions are fatigue, arthralgia, hypertension, nausea, edema, hypokalemia, hot flush, diarrhea, vomiting, upper respiratory infection, cough, and headache.",
            "Pregnancy & Lactation": "The safety and efficacy of Abiraterone have not been established in females. Based on findings from animal studies and the mechanism of action, Abiraterone can cause fetal harm and potential loss of pregnancy. There are no human data on the use of Abiraterone in pregnant women. The safety and efficacy of Abiraterone have not been established in females. There is no information available on the presence of abiraterone acetate in human milk, or on the effects on the breastfed child or milk production.",
            "Precautions & Warnings": "Mineralocorticoid excess: Closely monitor patients with cardiovascular disease. Control hypertension and correct hypokalemia before treatment. Monitor blood pressure, serum potassium and symptoms of fluid retention at least monthly.Adrenocortical insufficiency: Monitor for symptoms and signs of adrenocortical insufficiency. Increased dosage of corticosteroids may be indicated before, during and after stressful situations.Hepatotoxicity: Can be severe and fatal. Monitor liver function and modify, interrupt, or discontinue Abiraterone dosing as recommended.Increased fractures and mortality in combination with radium Ra 223 dichloride: Use of Abiraterone plus prednisone/prednisolone in combination with radium Ra 223 dichloride is not recommended.Embryo-Fetal Toxicity: Abiraterone can cause fetal harm. Advise males with female partners of reproductive potential to use effective contraception.",
            "Overdose Effects": "Human experience of overdose with Abiraterone is limited. There is no specific antidote. In the event of an overdose, stop Abiraterone, undertake general supportive measures, including monitoring for arrhythmias and cardiac failure and assess liver function.",
            "Therapeutic Class": "Cytotoxic Chemotherapy",
            "Storage Conditions": "Keep below 30°C temperature, away from light & moisture. Keep out of the reach of children."
        },
        {
            "name": "Acalabrutinib",
            "link": "https://medex.com.bd/generics/2040/acalabrutinib",
            "Indications": "Acalabrutinib is a kinase inhibitor indicated for the treatment of adult patients with:\n\nMantle cell lymphoma (MCL) who have received at least one prior therapy\nThis indication is approved under accelerated approval based on overall response rate Continued approval for this indication may be contingent upon verification and description of clinical benefit in confirmatory trials\nChronic lymphocytic leukemia (CLL) or small lymphocytic lymphoma (SLL)",
            "Pharmacology": "Acalabrutinib is a small-molecule inhibitor of BTK. Acalabrutinib and its active metabolite, ACP-5862, form a covalent bond with a cysteine residue in the BTK active site, leading to inhibition of BTK enzymatic activity. BTK is a signaling molecule of the B cell antigen receptor (BCR) and cytokine receptor pathways. In B cells, BTK signaling results in activation of pathways necessary for B-cell proliferation, trafficking, chemotaxis, and adhesion. In nonclinical studies, acalabrutinib inhibited BTK-mediated activation of downstream signaling proteins CD86 and CD69 and inhibited malignant B-cell proliferation and tumor growth in mouse xenograft models.",
            "Dosage & Administration": "The recommended dose is 100 mg orally approximately every 12 hours; swallow whole with water and with or without food. Advise patients not to break, open, or chew capsules. Manage toxicities using treatment interruption, dose reduction, or discontinuation. Avoid Acalabrutinib in patients with severe hepatic impairment.",
            "Interaction": "CYP3A Inhibitors: Avoid co-administration with strong CYP3A inhibitors. Dose adjustments may be recommended\nCYP3A Inducers: Avoid co-administration with strong CYP3A inducers. Dose adjustments may be recommended\nGastric Acid Reducing Agents: Avoid co-administration with proton pump",
            "Side Effects": "Most common adverse reactions (incidence ≥30%) were: anemia, neutropenia, upper respiratory tract infection, thrombocytopenia, headache, diarrhea, and musculoskeletal pain.",
            "Pregnancy & Lactation": "Based on findings in animals, Acalabrutinib may cause fetal harm and dystocia when administered to a pregnant woman. There are no available data in pregnant women to inform the drug-associated risk. No data are available regarding the presence of Acalabrutinib or its active metabolite in human milk, its effects on the breastfed child, or on milk production.",
            "Precautions & Warnings": "Serious and Opportunistic Infections: Monitor for signs and symptoms of infection and treat promptly\nHemorrhage: Monitor for bleeding and manage appropriately\nCytopenias: Monitor complete blood counts regularly\nSecond Primary Malignancies: Other malignancies have occurred, including skin cancers and other solid tumors. Advise patients to use sun protection\nAtrial Fibrillation and Flutter: Monitor for symptoms of arrhythmias and manage",
            "Therapeutic Class": "Tyrosine Kinase Inhibitor",
            "Storage Conditions": "Do not store above 30⁰C. Keep away from light and out of the reach of children."
        },
        {
            "name": "Acarbose",
            "link": "https://medex.com.bd/generics/27/acarbose",
            "Indications": "Acarbose is indicated as an adjunct to diet and exercise to improve glycemic control in adults with type 2 diabetes mellitus.",
            "Pharmacology": "In contrast to sulfonylureas, Acarbose does not enhance insulin secretion. The antihyperglycemic action of acarbose results from a competitive, reversible inhibition of pancreatic alpha-amylase and membrane-bound intestinal alpha-glucoside hydrolase enzymes. Pancreatic alpha-amylase hydrolyzes complex starches to oligosaccharides in the lumen of the small intestine, while the membrane-bound intestinal alpha-glucosidases hydrolyze oligosaccharides, trisaccharides, and disaccharides to glucose and other monosaccharides in the brush border of the small intestine. In diabetic patients, this enzyme inhibition results in a delayed glucose absorption and a lowering of postprandial hyperglycemia. Because its mechanism of action is different, the effect of Acarbose to enhance glycemic control is additive to that of sulfonylureas, insulin or metformin when used in combination. In addition, Acarbose diminishes the insulinotropic and weight-increasing effects of sulfonylureas. Acarbose has no inhibitory activity against lactase and consequently would not be expected to induce lactose intolerance.",
            "Dosage & Administration": "The recommended starting dosage of Acarbose is 25 mg given orally three times daily at the start (with the first bite) of each main meal. However, some patients may benefit from more gradual dose titration to minimize gastrointestinal side effects. This may be achieved by initiating treatment at 25 mg once per day and subsequently increasing the frequency of administration to achieve 25 mg t.i.d. Maintenance Dosage Once a 25 mg t.i.d. dosage regimen is reached, dosage of Acarbose should be adjusted at 4–8 week intervals based on one-hour postprandial glucose or glycosylated hemoglobin levels, and on tolerance. The dosage can be increased from 25 mg t.i.d. to 50 mg t.i.d. Some patients may benefit from further increasing the dosage to 100 mg t.i.d. The maintenance dose ranges from 50 mg t.i.d. to 100 mg t.i.d.",
            "Interaction": "Certain drugs tend to produce hyperglycemia and may lead to loss of blood glucose control. These drugs include the thiazides and other diuretics, corticosteroids, phenothiazines, thyroid products, estrogens, oral contraceptives, phenytoin, nicotinic acid, sympathomimetics, calcium channel-blocking drugs, and isoniazid. When such drugs are administered to a patient receiving Acarbose, the patient should be closely observed for loss of blood glucose control. When such drugs are withdrawn from patients receiving Acarbose in combination with sulfonylureas or insulin, patients should be observed closely for any evidence of hypoglycemia.Patients Receiving Sulfonylureas or Insulin: Sulfonylurea agents or insulin may cause hypoglycemia. Acarbose given in combination with a sulfonylurea or insulin may cause a further lowering of blood glucose and may increase the potential for hypoglycemia. If hypoglycemia occurs, appropriate adjustments in the dosage of these agents should be made. Very rarely, individual cases of hypoglycemic shock have been reported in patients receiving Acarbose therapy in combination with sulfonylureas and/or insulin.",
            "Contraindications": "Acarbose is contraindicated in patients with known hypersensitivity to the drug. Precose is contraindicated in patients with diabetic ketoacidosis or cirrhosis. Acarbose is also contraindicated in patients with inflammatory bowel disease, colonic ulceration, partial intestinal obstruction or in patients predisposed to intestinal obstruction. In addition, Acarbose is contraindicated in patients who have chronic intestinal diseases associated with marked disorders of digestion or absorption and in patients who have conditions that may deteriorate as a result of increased gas formation in the intestine.",
            "Side Effects": "Diarrhea, gas, upset stomach, constipation, or stomach pain may occur in the first few weeks of treatment as your body adjusts to this medication but usually improve with time. Follow your prescribed diet to help lessen these side effects. If any of these effects persist or worsen, tell your doctor or pharmacist promptly.",
            "Pregnancy & Lactation": "Pregnancy Category B. The safety of Acarbose in pregnant women has not been established. A small amount of radioactivity has been found in the milk of lactating rats after administration of radiolabeled acarbose. It is not known whether this drug is excreted in human milk. Because many drugs are excreted in human milk, Acarbose should not be administered to a nursing woman.",
            "Precautions & Warnings": "Because of its mechanism of action, Acarbose when administered alone should not cause hypoglycemia in the fasted or postprandial state. Sulfonylurea agents or insulin may cause hypoglycemia. Because Acarbose given in combination with a sulfonylurea or insulin will cause a further lowering of blood glucose, it may increase the potential for hypoglycemia. Hypoglycemia does not occur in patients receiving metformin alone under usual circumstances of use, and no increased incidence of hypoglycemia was observed in patients when Acarbose was added to metformin therapy.Oral glucose (dextrose), whose absorption is not inhibited by Acarbose, should be used instead of sucrose (cane sugar) in the treatment of mild to moderate hypoglycemia. Sucrose, whose hydrolysis to glucose and fructose is inhibited by Acarbose, is unsuitable for the rapid correction of hypoglycemia. Severe hypoglycemia may require the use of either intravenous glucose infusion or glucagon injection.",
            "Use in Special Populations": "Pediatric Use: safety and effectiveness of Acarbose in pediatric patients have not been established.Geriatric Use: of the total number of subjects in clinical studies of Acarbose in the United States, 27% were 65 and over, while 4% were 75 and over. No overall differences in safety and effectiveness were observed between these subjects and younger subjects.",
            "Overdose Effects": "Unlike sulfonylureas or insulin, an overdose of Acarbose will not result in hypoglycemia. An overdose may result in transient increases in flatulence, diarrhea, and abdominal discomfort which shortly subside. In cases of overdosage the patient should not be given drinks or meals containing carbohydrates (polysaccharides, oligosaccharides and disaccharides) for the next 4–6 hours.",
            "Therapeutic Class": "Alpha-Glucosidase inhibitor",
            "Storage Conditions": "Store below 25° C. Protect from moisture."
        },
        {
            "name": "Aceclofenac",
            "link": "https://medex.com.bd/generics/3/aceclofenac",
            "Indications": "Aceclofenac is indicated for the relief of pain and inflammation in osteoarthritis, rheumatoid arthritis, ankylosing spondylitis, toothache, trauma and lumbago.",
            "Pharmacology": "Aceclofenac is a non-steroidal drug with anti-inflammatory and analgesic properties. It is a potent inhibitor of the enzyme cyclooxygenase, which is involved in the production of prostaglandin. After oral administration, it is rapidly and completely absorbed an unchanged drug.",
            "Dosage & Administration": "Extended release tablet: The recommended dose in adults is one 200 mg Aceclofenac tablet daily or as prescribed by the physician.Film coated tablet: The recommended dose in adults is 100 mg, twice daily.",
            "Interaction": "No significant drug interactions has not been observed but close monitoring of patients is required when it is used with:\n\nLithium and Digoxin: may increase plasma concentration of lithium and digoxin.\nDiuretics: may interact the activity of diuretics.\nAnticoagulants: may enhance the activity of anticoagulant.\nMethotrexate: may increase the plasma level of methotrexate.",
            "Contraindications": "Aceclofenac is contraindicated in patients with known hypersensitivity to it or in whom aspirin or NSAIDs precipitate attacks of asthma.",
            "Side Effects": "Aceclofenac is a non-steroidal drug with anti-inflammatory and analgesic properties. It is a potent inhibitor of the enzyme cyclooxygenase, which is involved in the production of prostaglandin. After oral administration, it is rapidly and completely absorbed an unchanged drug.",
            "Pregnancy & Lactation": "The use of Aceclofenac should be avoided in pregnancy and lactation unless the potential benefits to the other outweigh the possible risks to the fetus.",
            "Precautions & Warnings": "Caution should be exercised to patients with active or suspected peptic ulcer or gastro-intestinal bleeding moderate to severe hepatic impairment and cardiac or renal impairment. Caution should also be exercised in patients suffering from dizziness or urticaria.",
            "Use in Special Populations": "There are no clinical data on the use of Aceclofenac in children.",
            "Therapeutic Class": "Drugs for Osteoarthritis, Drugs used for Rheumatoid Arthritis, Non-steroidal Anti-inflammatory Drugs (NSAIDs)",
            "Storage Conditions": "keep in a dry place away from light and heat. Keep out of the reach of children."
        },
        {
            "name": "Acemetacin",
            "link": "https://medex.com.bd/generics/21/acemetacin",
            "Indications": "Acemetacin is indicated in\n\nPain & inflammation associated with musculoskeletal & joint disorders. Such as: Rheumatoid arthritis, Osteoarthritis, Low back pain.\nPain after an operation.",
            "Pharmacology": "Acemetacin is a non-steroidal anti-inflammatory drug. It is also known as an NSAID. It works by blocking a substance in the body called cyclooxygenase (also known as COX) which is involved in the production of certain irritant chemicals in response to injury or rheumatic disease. By blocking the action of COX, Acemetacin reduces the symptoms of pain and inflammation.",
            "Dosage & Administration": "The recommended starting dose is 120mg/day in divided doses, increasing to 180mg/day in divided doses, depending on patient response. For the treatment of elderly patients, adjustment of dosage is not normally required. However, NSAIDs should be used with particular care in older patients who may be more prone to adverse reactions. Acemetacin should be taken with food, milk or an antacid to reduce the possibility of gastro-intestinal disturbance",
            "Interaction": "Acemetacin reduces the antihypertensive effect of b-blockers. Increase risk of convulsion when used with quinolone. Concurrent use with aspirin, NSAIDs or corticosteroids may increase risk of GI bleeding. Increased risk of methotrexate toxicity when used together.",
            "Contraindications": "Acemetacin is contraindicated to known hypersensitivity to Acemetacin or Indomethacin; peptic ulcer; safety in children is not established.",
            "Side Effects": "Common side effects include anorexia, nausea, vomiting, diarrhoea and constipation, peptic ulceration, headache, dizziness & vertigo. Rarely confusion, depressed mood, oedema, chest pain, blood urea elevation are found.",
            "Pregnancy & Lactation": "The safety of this medicine in human pregnancy and lactation has not been established. Some animal reproduction studies showed some toxic/ teratogenic effects on fetus. Therefore, use of this drug during pregnancy and lactation period is not recommended.",
            "Precautions & Warnings": "Caution should be taken in elderly people, history of disorders affecting the stomach or intestines, inflammatory bowel disease such as Crohn's disease or ulcerative colitis, kidney disease, liver disease, heart failure.",
            "Therapeutic Class": "Non-steroidal Anti-inflammatory Drugs (NSAIDs)",
            "Storage Conditions": "Store in a cool and dry place, below 25℃ and away from light."
        },
        {
            "name": "Acetate Formulation [Hemodialysis Solution]",
            "link": "https://medex.com.bd/generics/184/acetate-formulation-hemodialysis-solution",
            "Indications": "This solution is used for haemodialysis.",
            "Composition": "Calcium Chloride Dihydrate 0.5 %Magnessium Chloride 0.4 %Potassium Chloride 0.5 %Sodium Acetate 18.1 %Sodium Chloride 19.8 %",
            "Pharmacology": "Calcium chloride is used to prevent or treat negative calcium balance. It also regulates action potential excitation threshold to facilitate nerve and muscle performance.Potassium chloride is a major cation of the intracellular fluid. It plays an active role in the conduction of nerve impulses in the heart, brain and skeletal muscle; contraction of cardiac skeletal and smooth muscles; maintenance of normal renal function, acid-base balance, carbohydrate metabolism and gastric secretion.Magnessium Chloride acts as cofactor in numerous enzymatic reactions involving protein synthesis and carbohydrate metabolism; depresses CNS, blocks peripheral neuromuscular transmission, produces anticonvulsant effects.Sodium chloride is the major extracellular cation. It is important in electrolyte and fluid balance, osmotic pressure control and water distribution as it restores sodium ions. It is used as a source of electrolytes and water for hydration, treatment of metabolic acidosis, priming solution in haemodialysis and treatment of hyperosmolar diabetes. It is also used as diluents for infusion of compatible drug additives.",
            "Dosage & Administration": "Recommended dose: 5 liters concentrate per dialysis or as required.",
            "Interaction": "There are no known drug interactions and none well documented.",
            "Contraindications": "Known hypersensitivity to any of the ingredients of this preparation",
            "Side Effects": "Fluid and electrolyte imbalance, hypovolemia, hypotension or muscle cramping may occur.",
            "Pregnancy & Lactation": "Pregnancy Category-not Classified. FDA has not yet classified the drug into a specified pregnancy category.",
            "Precautions & Warnings": "It is used for haemodialysis purposes only.",
            "Therapeutic Class": "Haemodialysis solutions"
        },
        {
            "name": "Acetazolamide",
            "link": "https://medex.com.bd/generics/26/acetazolamide",
            "Indications": "Acetazolamide is indicated in open angle glaucoma, secondary glaucoma and as an adjuvant in the treatment of edema and epilepsy.",
            "Pharmacology": "Acetazolamide is a carbonic anhydrase inhibitor. This enzyme catalyzes the reversible reaction involving the hydration of carbon-di-oxide and the dehydration of carbonic acid. In the eye, this inhibitory action of Acetazolamide decreases the secretion of aqueous humor and results in a drop in intraocular pressure, a reaction considered desirable in case of glaucoma. Inhibition of carbonic anhydrase in the central nervous system appears to retard abnormal paroxysmal and excessive discharge from central nervous system neurons. So, Acetazolamide is also used as an adjuvant in the treatment of epilepsy.",
            "Dosage & Administration": "Adults : Initially 250 mg (1 tablet) 4 times daily. Dose should be adjusted later with individual need. Children : ½ to 2 tablets in divided doses. In intraocular pressure: 1 tablet 6 hourly. In acute condition, dose should be started with 2 tablets followed by 1 tablet 6 hourly or as directed by the physician",
            "Contraindications": "Acetazolamide is contraindicated in cases of marked kidney and liver diseases or dysfunction, in situations in which sodium and or potassium blood serum levels decreased. Acetazolamide is also contraindicated in patients with chronic noncongestive angle closure glaucoma",
            "Side Effects": "Common side effects are headache, drowsiness, dizziness, fatigue, anorexia, polyurea, insomnia, gastrointestinal upset.",
            "Pregnancy & Lactation": "There are no adequate and well controlled studies in pregnant women and neonates. So, Acetazolamide should be used with care in those physiological conditions.",
            "Therapeutic Class": "Carbonic anhydrase inhibitor",
            "Storage Conditions": "Keep below 30°C temperature, away from light & moisture. Keep out of the reach of children."
        },
        {
            "name": "Acetylcysteine",
            "link": "https://medex.com.bd/generics/6/acetylcysteine",
            "Indications": "Acetylcysteine is indicated as an adjuvant treatment in certain clinical condition characterized by the presence of thick and viscous mucoid or mucopurulent secretions such as: Chronic bronchopulmonary diseases (chronic obstructive pulmonary disease, emphysema with bronchitis, chronic asthmatic bronchitis ... Read moreAcetylcysteine is indicated as an adjuvant treatment in certain clinical condition characterized by the presence of thick and viscous mucoid or mucopurulent secretions such as: Chronic bronchopulmonary diseases (chronic obstructive pulmonary disease, emphysema with bronchitis, chronic asthmatic bronchitis, bronchiectasis); Acute bronchopulmonary diseases (asthma with bronchial mucus plugging, bronchitis, bronchopneumonia, tracheobronchitis, bronchiolitis, pulmonary complications of cystic fibrosis, pulmonary complications associated with surgery).",
            "Pharmacology": "Acetylcysteine is a mucolytic agent that reduces the viscosity of secretions probably by the splitting of disulphide bonds in mucoproteins. Moreover it gives antisecretory effect. These results in clearing of respiratory ducts and facilitate breathing. Acetylcysteine also has anti-oxidant properties by reacting with free radicals and also by serving as a precursor to glutathione, which is an important intra and extra-cellular antioxidant. By providing anti-oxidant action, it neutralizes exogenous and endogenous oxidants, which in fact act as pathogens in respiratory inflammations.",
            "Dosage & Administration": "Effervescent tablet or Dispersible tablet: Adults and children above 6 years: One effervescent tablet of Acetylcysteine 600 mg a day (preferably in the evening). The duration of treatment should be 5 to 10 days in the acute treatment, whereas it may be continued in the chronic states for several months, according to the advice of the physician. Dissolve the tablets in a glass containing a small quantity of water, mixing it, if necessary, with a spoon. A palatable solution is thus obtained, which can be drunk directly from the glass.Effervescent Granules:\n\nAdults and children above 6 years: 1 sachet Acetylcysteine 200 mg or 2 sachets Acetylcysteine 100 mg, 2-3 times a day.\nChildren (2-6 years of age): 1 sachet Acetylcysteine 100 mg from 2 to 4 times a day, according to the age.\n\r\nThe duration of treatment should be 5 to 10 days in the acute treatment, whereas it may be continued in the chronic states for several months, according to the advice of the physician.Dissolve the contents of the sachets in a glass containing a small quantity of water; mixing it, if necessary, with a spoon. A palatable solution is thus obtained, which can be drunk directly from the glass.Nebuliser Solution: The 20% solution may be diluted to a lesser concentration with either Sodium Chloride for injection, Sodium Chloride for inhalation, sterile water for injection, or sterile water for inhalation.\n\nAdult: 5-10 ml of 10% or 20% solution by Nebuliser every 6-8 hr PRN.\nChildren: 1-11 months: 1-2 ml of 20% or 2-4 ml of 10% solution by Nebuliser every 6-8 hr PRN.\n12 months-11 years: 3-5 ml of 20% or 6-10 ml of 10% solution by Nebuliser every 6-8 hr PRN.\nBelow 12 years: 5-10 ml of 10/20% solution by Nebuliser every 6-8 hr PRN.\n\n** Diagnostic Bronchograms: 1-2 ml of 20% or 2-4 ml of 10% solution 2-3 times by Nebulisation or by instillation intratracheally prior to procedure.** Nebulisation tent or croupette: This form of administration requires very large volumes of the solution, occasionally as much as 300 ml during a single treatment period. If a tent or croupette must be used, the recommended dose is the volume of acetylcysteine (using 20%) that will maintain a very heavy mist in the tent or croupette for the desired period. Administration for intermittent or continuous prolonged periods, including overnight, may be desirable.** Direct Instillation: When used by direct instillation, 1-2 ml of a 20% solution may be given as often as every hour. When used for the routine nursing care of patients with tracheostomy, 1-2 ml of a 20% solution may be given every 1-4 hours by instillation into the tracheostomy.",
            "Interaction": "The thiol group of Acetylcysteine can reduce the efficacy of certain antibiotics such as ampicillin, tetracycline, macrolides, cephalosporins, aminoglycosides and amphotericin. Concomitant use of Acetylcysteine and amoxicillin will increase the level of the antibiotic in tissues. It is, therefore, advisable to use the two medicines 2 hours apart from each other. Acetylcysteine can increase the inhibitory effect of thrombocyte aggregation and vasodialation by nitroglycerine.",
            "Contraindications": "Known hypersensitivity to Acetylcysteine. Acetylcysteine contains aspartame, thus it is contraindicated in patients suffering from phenylketonuria.",
            "Side Effects": "Like all medicines, Acetylcysteine can cause side effects, although not everybody gets them. In very rare cases, severe immune reactions may occur such as anaphylactic shock and severe skin reaction. In rare cases the oral administration can be followed by shortness of breath, upset stomach and bronchospasm. The most frequent side effects are headache, increased heart rate, stomatitis, pruritus, urticaria, nausea, vomiting, abdominal pain, fever, decrease in the blood pressure, diarrhoea and noises in the ears.",
            "Pregnancy & Lactation": "In case of pregnancy & lactation the medicine should be taken consulting physician or pharmacist.",
            "Precautions & Warnings": "Patients suffering from bronchial asthma must be strictly controlled during the therapy; should bronchospasm occur, the treatment must immediately be suspended. Caution should be taken in patients suffering from or with a history of peptic ulcer. As Viscotin contains sodium (156.9mg per dose) this has to be taken into consideration by patients on a controlled sodium diet. The possible presence of a sulphureous odor does not indicate an alteration of the product but is a characteristic of the active ingredient contained in this preparation. It is preferable not to mix other drugs with the Viscotin solution.",
            "Overdose Effects": "Overdose of Acetylcysteine may cause nausea, vomiting or diarrhoea.",
            "Therapeutic Class": "Antidote preparations, Cough expectorants & mucolytics",
            "Storage Conditions": "Store in a cool and dry place, protected from light."
        },
        {
            "name": "Acidic component [HCO3 Hemodialysis Solution]",
            "link": "https://medex.com.bd/generics/177/acidic-component-hco3-hemodialysis-solution",
            "Indications": "This solution is used in Haemodialysis.",
            "Composition": "Each 1 liter solution contains-\n\nSodium Chloride: 161.43 gm\nPotassium Chloride: 5.49 gm\nCalcium Chloride: 9.75 gm\nMagnessium Chloride: 3.74 gm\nGlacial Acetic Acid: 8.85 gm\nHighly purified water: q.s. to 1 liter",
            "Pharmacology": "Calcium chloride is used to prevent or treat negative calcium balance. It also regulates action potential excitation threshold to facilitate nerve and muscle performance.Potassium chloride is a major cation of the intracellular fluid. It plays an active role in the conduction of nerve impulses in the heart, brain and skeletal muscle; contraction of cardiac skeletal and smooth muscles; maintenance of normal renal function, acid-base balance, carbohydrate metabolism and gastric secretion.Sodium chloride is the major extracellular cation. It is important in electrolyte and fluid balance, osmotic pressure control and water distribution as it restores sodium ions. It is used as a source of electrolytes and water for hydration, treatment of metabolic acidosis, priming solution in haemodialysis and treatment of hyperosmolar diabetes. It is also used as diluents for infusion of compatible drug additives.Magnessium Chloride acts as cofactor in numerous enzymatic reactions involving protein synthesis and carbohydrate metabolism; depresses CNS, blocks peripheral neuromuscular transmission, produces anticonvulsant effects.",
            "Dosage & Administration": "Recommended dose: 5 liters concentrate per dialysis or as required.",
            "Interaction": "There are no known drug interactions and none well documented.",
            "Contraindications": "Known hypersensitivity to any of the ingredients of this preparation.",
            "Side Effects": "Fluid and electrolyte imbalance, hypovolemia, hypotension or muscle cramping may occur.",
            "Pregnancy & Lactation": "Pregnancy Category is not Classified. FDA has not yet classified the drug into a specified pregnancy category.",
            "Precautions & Warnings": "It is used for hemodialysis purposes only. Do not use solution A or B alone. Discard container in case visible solid particles inside.",
            "Therapeutic Class": "Haemodialysis solutions"
        },
        {
            "name": "Acitretin",
            "link": "https://medex.com.bd/generics/25/acitretin",
            "Indications": "Acitretin is indicated in severe extensive psoriasis which is resistant to other forms of therapy, palmo-plantar pustular psoriasis, severe congenital ichthyosis, severe Darier’s disease (keratosis follicularis).",
            "Pharmacology": "Acitretin is a retinoid, an aromatic analogue of vitamin A. The mechanism of action of acitretin is unknown, however, evidence exists for a wide range of actions at various cellular and subcellular levels. These include regulation of RNA/DNA synthesis, modulation of factors which influence epidermal proliferation, modification of glycoprotein synthesis and modulation of the immune response. Whatever the exact mechanism of action, the most prominent effect of acitretin is a modulation of cellular differentiation in the epidermis which re-establishes a more normal pattern of cell growth.",
            "Dosage & Administration": "Adult and elderly: Initial daily dose should be 25 mg or 30 mg for 2 to 4 weeks. After this initial treatment period the involved areas of the skin should show a marked response and/or side-effects should be apparent. In general, a daily dosage of 25-50 mg taken for a further 6 to 8 weeks to achieve optimal therapeutic results. However, it may be necessary in some cases to increase the dose up to a maximum of 75 mg/day.In patients with Darier’s disease a starting dose of 10 mg may be appropriate. The dose should be increased cautiously as isomorphic reactions may occur. Patients with severe congenital ichthyosis and severe Darier’s disease may require therapy beyond 3 months. The lowest effective dosage, not exceeding 50mg/day, should be given. Continuous use beyond 6 months is contra-indicated as only limited clinical data are available on patients treated beyond this length of time.Children: The daily dosage is about 0.5mg/kg. Higher doses (up to 1mg/kg daily) may be necessary in some cases for limited periods, but only up to a maximum of 35 mg/day.",
            "Interaction": "Existing data suggests that concurrent intake of acitretin with ethanol led to the formation of etretinate. Concomitant administration of methotrexate, tetracyclines or vitamin A and other retinoids with acitretin is contraindicated. In concurrent treatment with phenytoin, it must be remembered that Acitretin partially reduces the protein binding of phenytoin. Low dose progesterone-only products (minipills) may be an inadequate method of contraception during acitretin therapy, Investigations into the effect of acitretin on the protein binding of anticoagulants of the coumarin type (warfarin) revealed no interaction.",
            "Contraindications": "Acitretin is highly teratogenic and must not be used by women who are pregnant. The same applies to women of childbearing potential unless strict contraception is practiced 4 weeks before, during and for 2 years after treatment. The use of Acitretin is contra-indicated in women who are breast feeding.Acitretin is contraindicated in patients with severe hepatic or renal impairment and in patients with chronic abnormally elevated blood lipid values. Concomitant administration of Acitretin with other retinoids or Vitamin A is contra-indicated due to the risk of hypervitaminosis A. Acitretin is contra-indicated in cases of hypersensitivity to the preparation (acitretin or excipients) or to other retinoids. Patients with rare glucose-galactosemalabsorption should not take this medicine.",
            "Side Effects": "Adverse effects are seen in most patients receiving acitretin. Most of the clinical side-effects of Acitretin are dose-related and are usually well-tolerated at the recommended dosages. However, the toxic dose of Acitretin is close to the therapeutic dose and most patients experience some side-effects during theinitial period whilst dosage is being adjusted. The skin and mucous membranes are most commonly affected. An initial worsening of psoriasis symptoms issometimes seen at the beginning of the treatment period.",
            "Pregnancy & Lactation": "Acitretin is contraindicated in pregnant women or nursing mother. It is highly teratogenic. Its use is contraindicated in women who might become pregnant during or within 2 years of the cessation of treatment.",
            "Precautions & Warnings": "The risk of giving birth to a deformed child is exceptionally high if Acitretin is taken before or during pregnancy, no matter for how long or at what dosage. Women of childbearing potential must not receive blood from patients being treated with acitretin. Donation of blood by a patient being treated with acitretin is prohibited during and for two years after completion of treatment with acitretin. The effects of UV light are enhanced by retinoid therapy; therefore patients should avoid excessive exposure to sunlight. Hepatic function should be checked before starting treatment with Acitretin, every 1-2 weeks for the first 2 months after commencement and then every 3 months during treatment. Serum cholesterol and serum triglycerides (fasting values) must be monitored before starting treatment, one month after the commencement and then every 3 months during treatment, especially in high-risk patients and during long-term treatment. Retinoids can alter glucose tolerance, blood sugar levels should therefore be checked. Patients should be warned of the possibility of alopecia. Decreased night vision has been reported with acitretin therapy. Patients with severe headache, nausea, vomiting, and visual disturbances should discontinue acitretin immediately.",
            "Overdose Effects": "Manifestations of acute Vitamin A toxicity include severe headache, vertigo, nausea or vomiting, drowsiness, irritability and pruritus. Signs and symptoms of accidental or deliberate overdosage with Acitretin would probably be similar. Specific treatment is unnecessary because of the low acute toxicity of the preparation.",
            "Therapeutic Class": "Oral Retinoid preparations",
            "Storage Conditions": "Store in a cool & dry place, protected from light. Do not store above 25°C."
        },
        {
            "name": "Aclidinium Bromide + Formoterol Fumarate",
            "link": "https://medex.com.bd/generics/2060/aclidinium-bromide-formoterol-fumarate",
            "Indications": "It is indicated for the maintenance treatment of patients with chronic obstructive pulmonary disease (COPD).",
            "Pharmacology": "Aclidinium bromide: Aclidinium bromide is a long-acting anti-muscarinic agent, which is often referred to as an anticholinergic. It has similar affinity to the subtypes of muscarinic receptors M1 to M5. In the airways, it exhibits pharmacological effects through inhibition of M3 receptors at the smooth muscle leading to bronchodilation. The competitive and reversible nature of antagonism was shown with human and animal origin receptors and isolated organ preparations. In preclinical, in vitro as well as in vivo studies, prevention of acetylcholine-induced bronchoconstriction effects was dose-dependent and lasted longer than 24 hours. The clinical relevance of these findings is unknown. The bronchodilation following inhalation of aclidinium bromide is predominantly a site-specific effect.Formoterol fumarate: Formoterol fumarate is a long-acting selective beta2-adrenergic receptor agonist (LABA) (beta 2-agonist). Inhaled formoterol fumarate acts locally in the lung as a bronchodilator. The pharmacologic effects of beta 2-adrenoceptor agonist drugs, including formoterol, are at least in part attributable to stimulation of intracellular adenyl cyclase, the enzyme that catalyzes the conversion of adenosine triphosphate (ATP) to cyclic-3', 5'-adenosine monophosphate (cyclic AMP). Increased cyclic AMP levels cause relaxation of bronchial smooth muscle and inhibition of release of mediators of immediate hypersensitivity from cells, especially from mast cells.",
            "Dosage & Administration": "For oral inhalation only. Should be taken by revolizer. 400 mcg/12 meg, twice daily (One inhalation capsule in the morning and one in the evening ). Do not take more than one inhalation twice daily.",
            "Interaction": "Use of other adrenergic by any route may potentiate the effect of this combination. Use with caution.\n\nXanthine derivatives, steroids, diuretics or non-potassium sparing diuretics may potentiate hypokalemia or ECG changes. Use with caution.\nDiuretics: Electrocardiographic changes and/or hypokalemia associated with non-potassium sparing diuretics may worsen with concomitant beta2-agonists. Use with caution.\nMonoamine oxidase inhibitors and tricyclic antidepressants: Use with extreme caution. May potentiate effect of formoterol fumarate on cardiovascular system.\nBeta-blockers: Use with caution and only when medically necessary.\nAnticholinergics: May interact additively with concomitantly used anticholinergic medications. Avoid administrations of this combination with other anticholinergic-containing drugs.",
            "Contraindications": "Use of a long-acting beta 2-adrenergic agonist (LABA), including formoterol fumarate, one of the active ingredients in this combination, without an inhaled corticosteroid is contraindicated in patients with asthma.\nHypersensitivity to aclidinium bromide or formoterol fumarate or to any component of this product.",
            "Side Effects": "Most common adverse reactions (incidence 3% and more common than with placebo) include: upper respiratory tract infection and headache.",
            "Pregnancy & Lactation": "There are no adequate and well-controlled studies of Aclitol or its individual components, formoterol fumarate or aclidinium bromide, in pregnant women to inform drug-associated risks. There are no available data on the effects of aclidinium bromide, or formoterol fumarate on the breastfed child or on milk production or presence in human milk.",
            "Precautions & Warnings": "Asthma-related death: Long-acting beta2-adrenergic agonists as monotherapy (without an inhaled corticosteroid) for asthma increase the risk of serious asthma-related events.\nDo not initiate in acutely deteriorating COPD or to treat acute symptoms.\nDo not use in combination with additional medicine containing a LABA because of risk of overdose.\nIf paradoxical bronchospasm occurs, discontinue this combination and institute alternative therapy.\nUse with caution in patients with convulsive disorders, thyrotoxicosis, diabetes mellitus and ketoacidosis.\nBe alert to hypokalemia and hyperglycemia.\nUse with caution in patients with narrow-angle glaucoma and instruct patients to contact a physician immediately if symptoms occur.\nWorsening urinary retention may occur. Use with caution in patients with prostatic hyperplasia or bladder-neck obstruction and instruct patients to consult a physician immediately if symptoms occur.",
            "Therapeutic Class": "Combined bronchodilators",
            "Storage Conditions": "Keep out of reach of children. Protect from light & moisture, Store below 25°C."
        },
        {
            "name": "Activated Charcoal",
            "link": "https://medex.com.bd/generics/22/activated-charcoal",
            "Indications": "Diarrhoea & poisoning due to foods, heavy meals & drugs. Flatulence due to diet & other factors.",
            "Description": "Activated charcoal, also known as activated carbon, is a medication used to treat poisonings that occurred by mouth. To be effective it must be used within a short time of the poisoning occurring, typically an hour. It does not work for poisonings by cyanide, corrosive agents, iron, lithium, alcohols, or malathion. It may be taken by mouth or given by a nasogastric tube. Other uses include inside hemoperfusion machines.",
            "Pharmacology": "Active charcoal binds the poison and prevents its absorption by the gastrointestinal tract. In cases of suspected poisoning, medical personnel administer activated carbon on the scene or at a hospital's emergency department. In rare situations, it may also be used in a hemoperfusion system to remove toxins from the blood stream of poisoned patients. Activated carbon has become the treatment of choice for many poisonings, and other decontamination methods such as ipecac-induced emesis or stomach pumping are now used rarely. It interrupts the enterohepatic and enteroenteric circulation of some drugs/toxins and their metabolites.",
            "Dosage & Administration": "Diarrhoea:\n\nAdult: 2-4 tab tds-qds.\nChildren: ½ adult dose.\n\r\nPoisoning:\n\nAdult: 2-4 tab/kg body weight\nchildren: 3-4 tab/kg body weight\n\r\nFlatulence:\n\nAdult: Disintegrate 1-2 tab. Repeat every 2 hr.",
            "Interaction": "Ultracarbon should not be administered together with other drugs because their efficacy can be reduced.",
            "Contraindications": "Febrile diarrhoea. Medicinal charcoal should not be taken in the case of intoxication with corrosive substances (strong acids and alkalis) as this would complicate diagnostic measures eg, oesophagoscopy and gastroscopy.",
            "Side Effects": "As most undesirable effects are based on post-marketing spontaneous reporting, precise frequency estimation is not possible. No adverse reactions to Ultracarbon are known to occur if taken in the recommended dosage to treat the diarrhoea. After very high doses as those taken in intoxications, constipation and intestinal obstruction (mechanical ileus) may occur in individual cases; this can be prevented by administering saline laxatives (eg, sodium sulfate). As medicinal charcoal is excreted in unchanged form, the stools turn black (discoloured faeces) after intake of Ultracarbon tablets.",
            "Pregnancy & Lactation": "No data found",
            "Precautions & Warnings": "Several poisons and drugs require different or additional measures. Medicinal charcoal is not effective in intoxications with organic and inorganic salts as well as solvents eg, for instance, lithium, thallium, cyanide, iron salts, methanol, ethanol and ethylene glycol. Different measures are in these cases indicated to eliminate the poison (eg, gastric lavage). In many intoxications, a specific antidote must be administered additionally to medicinal charcoal (eg, acetylcysteine in paracetamol poisoning). To avoid aspiration in unconscious patients, a physician should administer the suspension of Ultracarbon tablets in water by gastric tube.In patients undergoing multiple dose, activated charcoal therapy after intoxication, gastrointestinal sounds should be monitored frequently to assess peristaltic action.Ultracarbon should not be used in cases of poisoning with pesticides.",
            "Overdose Effects": "Activated charcoal is well tolerated and due to its lack of toxicity, overdose requiring treatment is unlikely. Should symptoms of overdose like constipation and intestinal obstruction (mechanical ileus) occur, a saline laxative may be administered to enhance the elimination of Ultracarbon tablets.",
            "Therapeutic Class": "Anti-diarrhoeal, Antidote preparations",
            "Storage Conditions": "Do not store above 30°C."
        },
        {
            "name": "Acyclovir (Injection)",
            "link": "https://medex.com.bd/generics/7/acyclovir-injection",
            "Indications": "Acyclovir intravenous infusion is indicated for the treatment of-\n\nAcute clinical manifestations of Herpes simplex virus in immunocompromised patients\nSevere primary or non-primary genital herpes in immune competent patients\nVaricella zoster virus infection in immunocompromised patients ... Read moreAcyclovir intravenous infusion is indicated for the treatment of-\n\nAcute clinical manifestations of Herpes simplex virus in immunocompromised patients\nSevere primary or non-primary genital herpes in immune competent patients\nVaricella zoster virus infection in immunocompromised patients\nHerpes zoster (shingles) in immune competent patients who show very severe acute local or systemic manifestations of the disease\nHerpes simplex encephalitis",
            "Pharmacology": "Acyclovir exerts its antiviral e­ects on Herpes simplex virus and Varicella zoster virus by interfering with DNA synthesis and inhibiting viral replication. In cells infected with Herpes virus, the antiviral activity of Acyclovir appears to depend principally on the intracellular conversion of the drug to Acyclovir Triphosphate. Acyclovir is converted to Acyclovir Monophosphate principally via virus coded thymidine kinase, the monophosphate is phosphorylated to diphosphate via cellular guanylate kinase and then via other cellular enzymes to the Triphosphate, which is the pharmacologically active form of the drug.",
            "Dosage": "Herpes simplex infection: For normal or immunocompromised immune status: 5 mg/kg every 8 hours\nVery severe Herpes zoster infection (shingles): For normal immune status: 5 mg/kg every 8 hours\nVaricella zoster infection: For immunocompromised immune status: 10 mg/kg every 8 hours\nHerpes simplex encephalitis: For normal or immunocompromised immune status: 10 mg/kg every 8 hours\n\r\nEach dose should be administered by slow intravenous infusion over a one-hour period.",
            "Administration": "It is recommended that Acyclovir IV Injection for Intravenous Infusion should be administered for five to seven days in the treatment of most infections and for at least ten days in the treatment of Herpes simplex encephalitis.Acyclovir IV Injection after reconstitution may be injected directly into a vein over one hour by a controlled-rate infusion pump or be further diluted for administration by infusion. For intravenous infusion each vial of Acyclovir IV Injection should be reconstituted and then, wholly or in part according to the dosage required, added to and mixed with at least 50 mL-100 ml infusion solution. A maximum of 250 mg & 500 mg of Acyclovir may be added to 50 ml & 100 ml infusion solution respectively. After addition of Acyclovir IV Injection to an infusion solution the mixture should be shaken to ensure thorough mixing. Acyclovir IV Injection when diluted in accordance with the above schedule will give an Acyclovir concentration not greater than 0.5% w/v.Acyclovir IV Injection is known to be compatible with the following infusion fluids and stable for up to 12 hours at room temperature (below 25°C) when diluted to a concentration not greater than 0.5% w/v Acyclovir.\n\nSodium Chloride Intravenous Infusion BP (0.45% and 0.9% w/v)\nSodium Chloride (0.18% w/v) and Glucose (4% w/v) Intravenous Infusion\nSodium Chloride (0.45% w/v) and Glucose (2.5% w/v) Intravenous Infusion\nCompound Sodium Lactate Intravenous Infusion BP (Hartmann's Solution)\n\r\nAcyclovir IV Injection for Intravenous Infusion contains no preservative. Reconstitution and dilution should therefore be carried out immediately before use and any unused solution should be discarded. The solution should not be refrigerated.",
            "Interaction": "Co-administration of probenecid with Acyclovir has been shown to increase the mean Acyclovir half-life and the area under the concentration time curve. Urinary excretion and renal clearance correspondingly reduced. In patients over 60 years of age concurrent use of diuretics increases plasma levels of Acyclovir very significantly.",
            "Contraindications": "Acyclovir IV Injection is contraindicated in patients known to be hypersensitive to Acyclovir or Valacyclovir.",
            "Side Effects": "Some infrequent adverse reactions are lethargy, obtundation, tremors, confusion, hallucinations, agitation, somnolence, psychosis, convulsions and coma, phlebitis, nausea, vomiting, reversible increases in liver-related enzymes, pruritus, urticaria, rashes, increases in blood urea and creatinine. Local inflammatory reactions may occur if Acyclovir IV Infusion is inadvertently infused into extracellular tissues.",
            "Pregnancy & Lactation": "Pregnancy category B. There have been no adequate and well controlled studies concerning the safety of Acyclovir in pregnant women. It should not be used during pregnancy unless the benefits to the patient clearly outweigh the potential risks to the fetus. Acyclovir should only be administered to nursing mothers if the benefits to the mother outweigh the potential risks to the baby. There is no experience of the effect of Acyclovir on human fertility.",
            "Precautions & Warnings": "Acyclovir IV injection is intended for intravenous infusion only and should not be used through any other route. Reconstituted Acyclovir IV Infusion has a pH of approximately 11.0 and should not be administered by mouth. Acyclovir IV injection as infusion must be given over a period of at least one hour in order to avoid renal tubular damage. It should not be administered as a bolus injection. Acyclovir IV infusion must be accompanied by adequate hydration. Since maximum urine concentration occurs within the first few hours following infusion, particular attention should be given to establish sufficient urine ‑ow during that period. Concomitant use of other nephrotoxic drugs, pre-existing renal disease and dehydration increase the risk of further renal impairment by Acyclovir. As Acyclovir has been associated with reversible encephalopathic changes, it should be used with caution in patients with neurological abnormalities, significant hypoxia or serious renal, hepatic or electrolyte abnormalities.",
            "Use in Special Populations": "Pediatric use: The dose of Acyclovir IV injection in children aged 1-12 years should be calculated on the basis of body surface area. Children in this age group with Herpes simplex infections (except Herpes simplex encephalitis) or Varicella zoster infections should be given Acyclovir IV Infusion in doses of 250 mg/m2 (equivalent to 5 mg/kg in adults). Immunocompromised children in this age group with Varicella zoster virus infection or with Herpes simplex encephalitis should be given Acyclovir IV Infusion in doses of 500 mg/m2 (equivalent to 10 mg/kg in adults). Children with impaired renal function require an appropriately modified dose, according to the degree of impairment. Geriatric use: No data are available on this age group. However, as creatinine clearance is often low in the elderly, special attention should be given to dosage reduction.In patients with renal impairment: Acyclovir should be administered with caution since the drug is excreted through the kidneys. The following modifications in dosage are suggested:\n\nCrCl: 25-50 ml/min: 5 or 10 mg/kg every 12 hours\nCrCl: 10-25 ml/min: 5 or 10 mg/kg every 24 hours\nCrCl: 0-10 ml/min: 2.5 or 5 mg/kg every 24 hours and after dialysis.",
            "Overdose Effects": "Overdosage of intravenous Acyclovir has resulted in elevations of serum creatinine, blood urea nitrogen and subsequent renal failure. Neurological effects including confusion, hallucinations, agitation, seizures and coma have been described in association with over dosage. Adequate hydration is essential to reduce the possibility of crystal formation in the urine. Hemodialysis significantly enhances the removal of Acyclovir from the blood and may, therefore, be considered an option in the management of overdose of Acyclovir.",
            "Therapeutic Class": "Herpes simplex & Varicella-zoster virus infections",
            "Duration of Treatment": "It is recommended that Acyclovir IV Injection for Intravenous Infusion should be administered for five to seven days in the treatment of most infections and for at least ten days in the treatment of Herpes simplex encephalitis.",
            "Reconstitution": "Each 250 mg vial of Acyclovir IV Injection should be reconstituted by the addition of 10 ml of either Water for Injection or Sodium Chloride Intravenous Infusion (0.9% w/v). This provides a solution containing 25 mg Acyclovir per ml.Each 500 mg vial of Acyclovir IV Injection should be reconstituted by the addition of 10 ml of either Water for Injection or Sodium Chloride Intravenous Infusion (0.9% w/v). This provides a solution containing 50 mg Acyclovir per ml.",
            "Storage Conditions": "Store at 15°C to 25°C. Protected from light and moisture. Keep the medicine out of the reach of children."
        },
        {
            "name": "Acyclovir (Ophthalmic)",
            "link": "https://medex.com.bd/generics/13/acyclovir-ophthalmic",
            "Indications": "Acyclovir is indicated for the treatment of Herpes simplex keratitis.",
            "Pharmacology": "Acyclovir is an antiviral agent which is highly active in vitro against Herpes simplex (HSV) types I and II and Varicella zoster viruses, but its toxicity to mammalian cells is low. Acyclovir is phosphorylated to the active compound Acyclovir triphosphate after entry into herpes infected cell. The ­first step in this process requires the presence of the viral-coded thymidine kinase. Acyclovir triphosphate acts as an inhibitor of and substrate for the herpes specifi­ed DNA polymerase preventing further viral DNA synthesis without affecting normal cellular processes.",
            "Dosage & Administration": "The dosage for all age groups is the same. A 10 mm ribbon of the ointment should be placed inside the lower conjunctival sac ­five times a day at approximately four hourly intervals. Treatment should continue for at least 3 days after healing",
            "Interaction": "No clinically signi­ficant interactions have been identi­fied.",
            "Contraindications": "Acyclovir is contraindicated in patients known to be hypersensitive to Acyclovir or Valacyclovir",
            "Side Effects": "Very common: Superfi­cial punctate keratopathy. This did not necessitate an early termination of therapy and healed without apparent sequelae. Common: Transient mild stinging of the eye occurring immediately following application, conjunctivitis. Rare: Blepharitis.",
            "Pregnancy & Lactation": "Pregnancy category B. There are no adequate and well-controlled studies of Acyclovir in pregnant women. It is not known whether topically applied Acyclovir is excreted in breast milk.",
            "Precautions & Warnings": "The recommended dosage, frequency of applications, and length of treatment should not be exceeded.",
            "Overdose Effects": "No adverse effects would be expected if the entire contents of the tube containing 90 mg Acyclovir were ingested orally.",
            "Therapeutic Class": "Ophthalmic Anti-viral Products",
            "Storage Conditions": "Store in a cool and dry place. Keep away from light. Keep out of reach of children. Do not touch the tip of the tube since this may contaminate the product. After one month of the opening do not use the medicine of tube."
        },
        {
            "name": "Acyclovir (Oral)",
            "link": "https://medex.com.bd/generics/12/acyclovir-oral",
            "Indications": "Aciclovir is indicated for-\n\nThe treatment of viral infections due to Herpes simplex virus (type I & II) and Varicella zoster virus (herpes zoster & chicken pox).\nThe treatment of Herpes simplex virus infections of the skin and mucous membranes including initial and recurrent genital herpes and herpes labialis.\nThe prophylaxis of Herpes simplex infections in immunocompromised patients",
            "Pharmacology": "Aciclovir is a synthetic purine derivative. Aciclovir exerts its antiviral effect on Herpes simplex virus (HSV) and Varicella-zoster virus by interfering with DNA synthesis and inhibiting viral replication. In cells infected with herpes virus, the antiviral activity of Aciclovir appears to depend principally on the intracellular conversion of the drug to Aciclovir Triphosphate. Aciclovir is converted to Aciclovir Monophosphate principally via virus coded thymidine kinase; the monophosphate is phosphorylated to the diphosphate via cellular guanylate kinase and then via another cellular enzyme to the triphosphate, which is the pharmacologically active form of the drug. 15-30% of an oral dose of the drug is absorbed from Gl tract. Peak plasma concentrations usually occur within 1.5-2 hours after oral administration. It is widely distributed into body tissues and fluids including the brain, saliva, lungs, liver, muscle, spleen, uterus, vaginal mucosa and secretions, CSF, and herpetic vesicular fluid. Aciclovir is excreted through the kidney by the glomerular filtration & tubular secretion.",
            "Dosage & Administration": "Treatment of initial herpes simplex: 200 mg 5 times daily usually for 5 days. For immunocompromised patients:\n\nAdult: 400 mg 5 times daily for 5 days (longer if new lesions appear during treatment or if healing is incomplete; increase dose to 800 mg 5 times daily for genital herpes in immunocompromised) or as directed by the registered physician.\nChildren under 2 years: Half of the adult dose.\nChildren over 2 years: Adult dose.\n\r\nPrevention of recurrence of herpes simplex: \n\nAdult: 200 mg 4 times daily or 400 mg twice daily possibly reduced to 200 mg 2 or 3 times daily and interrupted every 6-12 months.\nChildren under 2 years: Half of the adult dose.\nChildren over 2 years: Adult dose.\n\r\nProphylactic treatment of herpes simplex in the immunocompromised patients: \n\nAdult: 200 to 400 mg 4 times daily.\nChildren under 2 years: Half of the adult dose.\nChildren over 2 years: Adult dose.\n\r\nTreatment of vericella (chicken pox):\n\nAdult and children over 40 kg: 800 mg 4 times daily for 5 days.\nChildren below 40 kg: 20 mg/kg (maximum 800 mg) per dose orally 4 times daily (80 mg/kg/day) for 5 days.\nChildren 1 month-2 years: 200 mg 4 times daily for 5 days.\nChildren 2-5 years:400 mg 4 times daily for 5 days.\nChildren 6-12 years:800 mg 4 times daily for 5 days.\n\r\nTreatment of herpes zoster (Shingles): 800 mg 5 times daily for 7 days.Treatment of initial rectal (Proctitis) herpes infections: An oral Aciclovir dosage of 400 mg 5 times daily for 10 days or until clinical resolution occurs has been recommended.Renal Impairment: For patients with severe renal impairment, a reduction of the doses is recommended.",
            "Interaction": "Probenecid reduces Aciclovir excretion and so increases plasma concentration and risk of toxicity.",
            "Contraindications": "Aciclovir is contraindicated in patients known to be hypersensitive to Aciclovir.",
            "Side Effects": "Rash, gastrointestinal disturbance, rise in bilirubin and liver-related enzymes, increase in blood urea and creatinine, decrease in hematological indices, headache, neurological reaction, fatigue.",
            "Pregnancy & Lactation": "Pregnancy category B. Aciclovir should not be used during pregnancy unless the potential benefit justifies the potential risk to the fetus. Caution should be exercised when it is administered to a nursing mother.",
            "Precautions & Warnings": "Aciclovir should be administered with caution in patients with renal impairment and doses should be adjusted according to creatinine clearance. Monitor neutrophil count at least twice weekly in neonates.",
            "Therapeutic Class": "Herpes simplex & Varicella-zoster virus infections",
            "Storage Conditions": "Should be stored below 25°C. It should be protected from light and moisture.Keep out of the reach of children."
        },
        {
            "name": "Acyclovir (Topical)",
            "link": "https://medex.com.bd/generics/9/acyclovir-topical",
            "Indications": "Acyclovir cream is a herpes simplex virus (HSV) nucleoside analogue DNA polymerase inhibitor indicated for the treatment of recurrent herpes labialis (cold sores) in immunocompetent adults and adolescents 12 years of age and older.",
            "Pharmacology": "Acyclovir is an antiviral drug active against herpes simplex virus. Acyclovir is a synthetic purine nucleoside analogue with cell culture and in vivo inhibitory activity against HSV types 1 (HSV-1) and 2 (HSV-2). The inhibitory activity of acyclovir is highly selective due to its affinity for the enzyme thymidine kinase (TK) encoded by HSV. This viral enzyme converts acyclovir into acyclovir monophosphate, a nucleotide analogue. The monophosphate is further converted into diphosphate by cellular guanylate kinase and into triphosphate by a number of cellular enzymes. In cell culture, acyclovir triphosphate stops replication of herpes viral DNA. This inhibition is accomplished in 3 ways: 1) competitive inhibition of viral DNA polymerase, 2) incorporation into and termination of the growing viral DNA chain, and 3) inactivation of the viral DNA polymerase.",
            "Dosage & Administration": "Acyclovir cream should be applied five times per day for four days. Therapy should be initiated as early as possible following the onset of signs or symptoms of herpes labialis i.e., during the prodrome or when lesions appear. For adolescents 12 years of age and older, the dosage is the same as in adults.",
            "Interaction": "Clinical experience has identified no interactions resulting from topical or systemic administration of other drugs concomitantly with Acyclovir cream. Due to minimal systemic absorption of Acyclovir cream, systemic drug interactions are unlikely.",
            "Contraindications": "Acyclovir cream is contraindicated in patients with known hypersensitivity to acyclovir, valacyclovir, or any component of the formulation.",
            "Side Effects": "The most common adverse reactions at the site of topical application were dry lips, desquamation, dryness of skin, cracked lips, burning skin, pruritus, flakiness of skin, and stinging on skin; each adverse reaction occurred in less than 1% of patients receiving Acyclovir cream and placebo. Three patients on Acyclovir cream and one patient on placebo discontinued treatment due to an adverse event.",
            "Pregnancy & Lactation": "Pregnancy Category B. There are no adequate and well-controlled studies of acyclovir cream in pregnant women. Acyclovir cream should be used during pregnancy only if the potential benefit justifies the potential risk to the fetus. It is not known whether topically applied acyclovir is excreted in breast milk. Systemic exposure following topical administration is minimal.",
            "Precautions & Warnings": "Acyclovir cream should only be applied on the affected external aspects of the lips and face in patients with herpes labialis. Because no data are available, application to human mucous membranes is not recommended. Acyclovir cream is intended for cutaneous use only and should not be used in the eye or inside the mouth or nose. Cream has a potential for irritation and contact. The effect of Acyclovir cream has not been established in immunocompromised patients.",
            "Use in Special Populations": "Pediatric Use: An open-label, uncontrolled trial with Acyclovir cream 5% was conducted in 113 patients aged 12 to 17 years with recurrent herpes labialis. In this trial, therapy was applied using the same dosing regimen as in adults and subjects were followed for adverse events. The safety profile was similar to that observed in adults. Safety and effectiveness in pediatric patients less than 12 years of age have not been established.Geriatric Use: Clinical studies of acyclovir cream did not include sufficient numbers of subjects aged 65 and over to determine whether they respond differently from younger subjects. Other reported clinical experience has not identified differences in responses between the elderly and younger patients. Systemic absorption of acyclovir after topical administration is minimal.",
            "Therapeutic Class": "Topical Antiviral preparations",
            "Storage Conditions": "Store Acyclovir cream at room temperature between 20°C to 25°C"
        },
        {
            "name": "Acyclovir + Hydrocortisone",
            "link": "https://medex.com.bd/generics/10/acyclovir-hydrocortisone",
            "Indications": "Acyclovir & Hydrocortisone Cream is indicated for the early treatment of recurrent herpes labialis (cold sores) to reduce the likelihood of ulcerative cold sores and to shorten the lesion healing time in adults and children (6 years of age and older).",
            "Pharmacology": "Acyclovir is a synthetic purine nucleoside analogue with inhibitory activity against Herpes simplex viruses type 1 (HSV-1) and type 2 (HSV-2) in cell culture and in vivo. The inhibitory activity of Acyclovir is highly selective due to its affinity for the enzyme thymidine kinase (TK) encoded by HSV. This viral enzyme converts Acyclovir into Acyclovir monophosphate, a nucleotide analogue. The monophosphate is further converted into diphosphate by cellular guanylate kinase and into triphosphate by a number of cellular enzymes. In cell culture, Acyclovir Triphosphate stops replication of herpes viral DNA. This inhibition is accomplished in 3 ways: \n\nCompetitive inhibition of viral DNA polymerase\nIncorporation into and termination of the growing viral DNA chain\nInactivation of the viral DNA polymerase\n\r\nHydrocortisone is the main glucocorticoid secreted by the adrenal cortex. It is used topically for its anti-inflammatory effects which suppress the clinical manifestations of the disease in a wide range of disorders where inflammation is a prominent feature.",
            "Dosage & Administration": "The cream should be topically applied 5 times per day for 5 days. Therapy should be initiated as early as possible after the first signs and symptoms.",
            "Contraindications": "There is no known contraindication.",
            "Side Effects": "The following most common adverse reactions (<1%) were local skin reactions like drying or flaking of the skin; burning or tingling, erythema; pigmentation changes, application site reactions including signs and symptoms of inflammation.",
            "Pregnancy & Lactation": "Pregnancy Category B. There are no adequate and well-controlled studies of systemic Acyclovir in pregnant women. No studies have been performed in pregnant women. Systemic exposure of Acyclovir and Hydrocortisone following topical administration of this cream is minimal. It is not known whether topically applied Acyclovir or Hydrocortisone is excreted in breast milk. Because many drugs are excreted in human milk, caution should be exercised when administered to a nursing woman.",
            "Precautions & Warnings": "Acyclovir and Hydrocortisone should not be used in the eye, inside the mouth or nose, or on the genitals. Patients should seek medical advice when a cold sore fails to heal within 2 weeks.",
            "Use in Special Populations": "Safety and effectiveness in pediatric subjects less than 6 years of age have not been established.",
            "Therapeutic Class": "Hydrocortisone & Combined preparations",
            "Storage Conditions": "Keep below 30°C temperature, away from light & moisture. Keep out of the reach of children."
        },
        {
            "name": "Adalimumab",
            "link": "https://medex.com.bd/generics/31/adalimumab",
            "Indications": "Adalimumab is a tumor necrosis factor (TNF) blocker indicated for treatment of: \n\nRheumatoid Arthritis (RA): Reducing signs and symptoms, inducing major clinical response, inhibiting the progression of structural damage, and improving physical function in adult patients with moderately to severely active RA ... Read moreAdalimumab is a tumor necrosis factor (TNF) blocker indicated for treatment of: \n\nRheumatoid Arthritis (RA): Reducing signs and symptoms, inducing major clinical response, inhibiting the progression of structural damage, and improving physical function in adult patients with moderately to severely active RA\nJuvenile Idiopathic Arthritis (JIA): Reducing signs and symptoms of moderately to severely active polyarticular JIA in patients 2 years of age and older\nPsoriatic Arthritis (PsA): Reducing signs and symptoms, inhibiting the progression of structural damage, and improving physical function in adult patients with active PsA\nAnkylosing Spondylitis (AS): Reducing signs and symptoms in adult patients with active AS\nAdult Crohn’s Disease (CD): Reducing signs and symptoms and inducing and maintaining clinical remission in adult patients with moderately to severely active Crohn’s disease who have had an inadequate response to conventional therapy. Reducing signs and symptoms and inducing clinical remission in these patients if they have also lost response to or are intolerant to infliximab\nPediatric Crohn’s Disease: Reducing signs and symptoms and inducing and maintaining clinical remission in patients 6 years of age and older with moderately to severely active Crohn’s disease who have had an inadequate response to corticosteroids or immunomodulators such as azathioprine, 6-mercaptopurine, or methotrexate\nUlcerative Colitis (UC): Inducing and sustaining clinical remission in adult patients with moderately to severely active ulcerative colitis who have had an inadequate response to immunosuppressants such as corticosteroids, azathioprine or 6-mercaptopurine (6-MP). The effectiveness of Adalimumab has not been established in patients who have lost response to or were intolerant to TNF blockers\nPlaque Psoriasis (Ps): The treatment of adult patients with moderate to severe chronic plaque psoriasis who are candidates for systemic therapy or phototherapy and when other systemic therapies are medically less appropriate\nHidradenitis Suppurative (HS): The treatment of moderate to severe hidradenitis suppurativa",
            "Pharmacology": "Adalimumab is a recombinant human IgG1 monoclonal antibody specific for human tumor necrosis factor (TNF). Adalimumab binds specifically to TNF-alpha and blocks its interaction with the p55 and p75 cell surface TNF receptors. Adalimumab also lyses surface TNF expressing cells in vitro in the presence of complement. TNF is a naturally occurring cytokine that is involved in normal inflammatory and immune responses. Elevated levels of TNF are found in the synovial fluid of patients with Rheumatoid Arthritis, Juvenile Idiopathic Arthritis, Psoriatic Arthritis, and Ankylosing Spondylitis and play an important role in both the pathologic inflammation and the joint destruction that are hallmarks of these diseases. Increased levels of TNF are also found in psoriasis plaques. In Plaque Psoriasis, treatment with Adalimumab may reduce the epidermal thickness and infiltration of inflammatory cells.",
            "Dosage": "Rheumatoid Arthritis, Psoriatic Arthritis, Ankylosing Spondylitis: 40 mg every other week Some patients with RA not receiving methotrexate may benefit from increasing the frequency to 40 mg every week. Juvenile Idiopathic Arthritis: \n\n10 kg to <15 kg: 10 mg every other week\n15 kg to < 30 kg: 20 mg every other week\n≥ 30 kg: 40 mg every other week\n\r\nAdult Crohn's Disease and Ulcerative Colitis: \n\nInitial dose (Day 1): 160 mg (four 40 mg injections in one day or two 40 mg injections per day for two consecutive days).\nSecond dose two weeks later (Day 15): 80 mg.\nTwo weeks later (Day 29): Maintenance dose of 40 mg every other week.\nFor patients with Ulcerative Colitis only: Adalimumab should only be continued in patients who have shown evidence of clinical remission by eight weeks (Day 57) of therapy.\n\r\nPediatric Crohn’s Disease: \n\n17 kg to < 40 kg: Initial dose (Day 1): 80 mg (two 40 mg injections in one day) , Second dose two weeks later (Day 15): 40 mg , Two weeks later (Day 29): Maintenance dose of 20 mg every other week.\n≥ 40 kg: Initial dose (Day 1): 160 mg (four 40 mg injections in one day or two 40 mg injections per day for two consecutive days) , Second dose two weeks later (Day 15): 80 mg (two 40 mg injections in one day) , Two weeks later (Day 29): Maintenance dose of 40 mg every other week.\n\r\nPlaque Psoriasis: \n\n80 mg initial dose, followed by 40 mg every other week starting one week after initial dose.\nHidradenitis Suppurativa: Initial dose (Day 1): 160 mg (given as four 40 mg injection on Day 1 or as two 40 mg injections per day on Days 1 and 2, Second dose two weeks later (Day 15): 80 mg (two 40 mg injections in one day), Third (Day 29) and subsequent doses: 40 mg every week.",
            "Administration": "Administered by subcutaneous injection.",
            "Interaction": "Abatacept: Increased risk of serious infection Anakinra: Increased risk of serious infection Live vaccines: Adalimumab use should be avoided",
            "Contraindications": "Adalimumab should not be administered to patients with known hypersensitivity to Adalimumab or any of its components.",
            "Side Effects": "The most common adverse reaction with Adalimumab was injection site reactions (erythema and/or itching, hemorrhage, pain or swelling). The most common adverse reactions leading to discontinuation of Adalimumab in rheumatoid arthritis were clinical flare reaction, rash and pneumonia. \n\nOther adverse reactions of Adalimumab includes- Gastrointestinal disorders: Diverticulitis, large bowel perforations including perforations associated with diverticulitis and appendiceal perforations associated with appendicitis, pancreatitis.\nGeneral disorders and administration site conditions: Pyrexia.\nHepato-biliary disorders: Liver failure, hepatitis.\nImmune system disorders: Sarcoidosis.\nNeoplasms benign, malignant and unspecified (including cysts and polyps): Merkel Cell Carcinoma (neuroendocrine carcinoma of the skin). \nNervous system disorders: Demyelinating disorders (e.g., optic neuritis, Guillain-Barré syndrome).\nCerebrovascular accident Respiratory disorders: Interstitial lung disease, including pulmonary fibrosis.\nPulmonary embolism Skin reactions: Stevens Johnson Syndrome, cutaneous vasculitis, erythema multiforme, new or worsening psoriasis (all sub-types including pustular and palmoplantar), alopecia.\nVascular disorders: Systemic vasculitis, deep vein thrombosis.",
            "Pregnancy & Lactation": "Pregnancy Category B. Adequate and well controlled studies with Adalimumab have not been conducted in pregnant women. Adalimumab is an IgG1 monoclonal antibody and IgG1 is actively transferred across the placenta during the third trimester of pregnancy. Limited data from published literature indicate that Adalimumab is present in low levels in human milk and is not likely to be absorbed by a breastfed infant. However, no data is available on the absorption of Adalimumab from breast milk in newborn or preterm infants. Caution should be exercised when Adalimumab is administered to a nursing woman.",
            "Precautions & Warnings": "Serious infections: Adalimumab should not be started during an active infection. If an infection develops, should be carefully monitored and if infection becomes serious Adalimumab should be stopped.\nInvasive fungal infections: For patients who develop a systemic illness on Adalimumab, empiric antifungal therapy should be considered for those who reside or travel to regions where mycoses are endemic\nMalignancies: Incidence of malignancies was greater in Adalimumab-treated patients than in controls\nAnaphylaxis or serious allergic reactions may occur Hepatitis B virus reactivation: HBV carriers should be monitored during and several months after therapy. If reactivation occurs, Adalimumab should be stopped and antiviral therapy should be started\nDemyelinating disease: Exacerbation or new onset, may occur Cytopenias, pancytopenia: Patients should be advised to seek immediate medical attention if symptoms develop, and should be considered stopping Adalimumab\nHeart failure: Worsening or new onset, may occur\nLupus-like syndrome: Adalimumab should be stopped if syndrome develops",
            "Use in Special Populations": "Pediatric Use: Safety and efficacy of Adalimumab in pediatric patients for uses other than polyarticular juvenile idiopathic arthritis (JIA) and pediatric Crohn’s disease have not been established.Geriatric Use: A total of 519 patients 65 years of age and older, including 107 patients 75 years and older, received Adalimumab in clinical studies. No overall difference in effectiveness was observed between these subjects and younger subjects. The frequency of serious infection and malignancy among Adalimumab treated subjects over age 65 was higher than for those under age 65. Because there is a higher incidence of infections and malignancies in the elderly population in general, caution should be used when treating the elderly.",
            "Overdose Effects": "The maximum tolerated dose of Adalimumab has not been established in humans. Multiple doses up to 10 mg/kg have been administered to patients in clinical trials without evidence of dose-limiting toxicities. In case of overdosage, it is recommended that the patient be monitored for any signs or symptoms of adverse reactions or effects and appropriate symptomatic treatment instituted immediately.",
            "Therapeutic Class": "Disease-modifying antirheumatic drugs (DMARDs), Immunosuppressant",
            "Storage Conditions": "Do not use beyond the expiration date on the container. Adalimumab must be refrigerated at 2-8° C. Do not freeze. Protect the pre-filled syringe from exposure to light. Store in original carton until time of administration."
        }
    ],
    [
        {
            "name": "Adapalene",
            "link": "https://medex.com.bd/generics/14/adapalene",
            "Indications": "Adapalene cream or gel is indicated for topical treatment of acne vulgaris.",
            "Pharmacology": "Adapalene acts on retinoid receptors that are commonly found in the skin of face, back and chest. Biochemical and pharmacological studies have demonstrated that Adapalene is a modulator of cellular differentiation, keratinization, and inflammatory processes, all of that represent important features in the pathology of acne vulgaris. Adapalene binds with specific retinoic acid nuclear receptors that normalize the differentiation of follicular epithelial cells resulting in decreased microcomedone formation. Absorption of Adapalene through human skin is low.",
            "Dosage": "Adapalene 0.1%: It should be applied to the affected areas of skin, once daily at night-time.Adapalene 0.3%: It should be applied to the entire face and any other affected areas of the skin, once daily in the evening.Children below 12 years of age: Safety and effectiveness in children below 12 years of age have not been established.",
            "Administration": "A thin film of gel or cream should be applied to the skin areas where lesions present, using enough to cover the entire affected areas lightly.",
            "Interaction": "Concomitant use of other potentially irritating topical products (medicated or abrasive soaps and cleansers, soaps and cosmetics that have a strong drying effect, products with high concentrations of alcohol, astringents, spices or lime) should be approached with caution. Exercise particular caution in using preparations containing sulfur, resorcinol or salicylic acid in combination with Adapalene. If any of these preparations have been used, it is advisable not to start therapy with Adapalene until the effects of such preparations in skin have subsided. If combined use of both medications is important, it is better to use in two different times.",
            "Contraindications": "Adapalene should not be administered to individuals who are hypersensitive to Adapalene or any of its components.",
            "Side Effects": "Erythema, scaling, dryness, pruritus, burning sensation, skin irritation, stinging unburn, acne flares, etc. are commonly seen during the first month of therapy but usually lessen with continued use of the medication.",
            "Pregnancy & Lactation": "Use Adapalene during pregnancy only if the potential benefit justifies the potential risk to the fetus. It is not known whether this drug is excreted in breast milk. Exercise caution when administering Adapalene to a nursing mother.",
            "Precautions & Warnings": "Adapalene should not be applied to cuts, abrasions, eczematous or sunburned skin.",
            "Therapeutic Class": "Topical retinoid and related preparations",
            "Storage Conditions": "Store in a cool (below 25°C) and dry place protected from light and moisture. Keep out of the reach of children. Keep the tube tightly closed after use."
        },
        {
            "name": "Adapalene + Benzoyl peroxide",
            "link": "https://medex.com.bd/generics/11/adapalene-benzoyl-peroxide",
            "Indications": "Adapalene & Benzoyl peroxide gel is indicated for the topical treatment of acne vulgaris in patients 12 years of age and older.",
            "Pharmacology": "Adapalene & Benzoyl peroxide gel is indicated for the topical treatment of acne vulgaris in patients 12 years of age and older. Adapalene binds to specific retinoic acid nuclear receptors but does not bind to cytosolic receptor protein. Biochemical and pharmacological profile studies have demonstrated that Adapalene is a modulator of cellular differentiation, keratinization and inflammatory processes. Adapalene binds with specific retinoic acid nuclear receptors that normalize the differentiation of follicular epithelial cells resulting in decreased microcomedone formation. Benzoyl peroxide is an oxidizing agent with bacteriocidal and keratolytic effects.",
            "Dosage & Administration": "Apply a thin film of Adapalene & Benzoyl peroxide gel to affected areas of the face and/or trunk once daily after washing. Use a pea-sized amount for each area of the face (e.g., forehead, chin, each cheek). Avoid the eyes, lips and mucous membranes. Adapalene & Benzoyl peroxide is not for oral, ophthalmic, or intravaginal use.Pediatric use: The safety and effectiveness of Adapalene and Benzoyl peroxide gel in pediatric patients under the age of 12 years have not been established.",
            "Interaction": "Concomitant topical acne therapy should be used with caution because a possible cumulative irritancy effect may occur, especially with the use of peeling, desquamating, or abrasive agents. No formal drug-drug interaction studies were conducted.",
            "Contraindications": "Should not be administered to individuals who are hypersensitive to any of its component.",
            "Side Effects": "Erythema, scaling, dryness, and stinging/ burning may occur. Most commonly reported adverse events are dry skin, contact dermatitis, application site burning, application site irritation, and skin irritation.",
            "Pregnancy & Lactation": "There are no well-controlled trials in pregnant women treated with Adapalene and Benzoyl peroxide. Animal reproduction studies have not been conducted with the combination gel or Benzoyl peroxide. Furthermore, such studies are not always predictive of human response; therefore, this preparation should be used during pregnancy only if the potential benefit justifies the risk to the fetus. It is not known whether Adapalene or Benzoyl peroxide is excreted in human milk following use. Caution should be exercised when administered to a nursing woman.",
            "Precautions & Warnings": "Avoid exposure to sunlight and sunlamps. Wear sunscreen when sun exposure cannot be avoided.",
            "Therapeutic Class": "Topical retinoid and related preparations",
            "Storage Conditions": "Store in a cool (below 25°C) and dry place protected from light and moisture. Keep out of the reach of children. Keep the tube tightly closed after use."
        },
        {
            "name": "Adefovir Dipivoxil",
            "link": "https://medex.com.bd/generics/15/adefovir-dipivoxil",
            "Indications": "Adefovir Dipivoxil is indicated for the treatment of chronic hepatitis B in adults with evidence of active viral replication and either evidence of persistent elevations in serum aminotransferases (ALT or AST) or histologically active disease.",
            "Pharmacology": "Adefovir dipivoxil is a diester prodrug of adefovir. Adefovir is an acyclic nucleotide analog with activity against human hepatitis B virus (HBV). Adefovir is phosphorylated to the active metabolite, adefovir diphosphate, by cellular kinases. Adefovir diphosphate inhibits HBV DNA polymerase (reverse transcriptase) by competing with the natural substrate deoxyadenosine triphosphate and by causing DNA chain termination after its incorporation into viral DNA. The approximate oral bioavailability of adefovir from a 10 mg single dose is 59%. In vitro binding of adefovir to human plasma or human serum proteins is 4%. Adefovir is excreted through renal route by a combination of glomerular filtration and active tubular secretion.",
            "Dosage & Administration": "The recommended dose of Adefovir in chronic hepatitis B patients with adequate renal function is 10 mg, once daily, taken orally, without regard to food.",
            "Interaction": "The pharmacokinetics of adefovir was unchanged when adefovir dipivoxil was coadministered with lamivudine, trimethoprim/ sulfamethoxazole and acetaminophen. When adefovir dipivoxil was co-administered with ibuprofen (800 mg three times daily), increases in adefovir Cmax (33%), AUC (23%) and urinary recovery were observed due to higher oral bioavailability of adefovir.",
            "Contraindications": "Adefovir dipivoxil is contraindicated in patients with previously demonstrated hypersensitivity to any of the components of the product.",
            "Side Effects": "The most common side effects of adefovir dipivoxil are weakness, headache, stomach pain and nausea. Severe acute exacerbations of hepatitis have been reported in patients who have discontinued anti-hepatitis B therapy, including therapy with adefovir dipivoxil. In patients at risk of or having underlying renal dysfunction, chronic administration of adefovir dipivoxil may result in nephrotoxicity. Lactic acidosis and severe hepatomegaly with steatosis, including fatal cases, have been reported with the use of nucleoside analogs alone or in combination with other antiretrovirals.",
            "Pregnancy & Lactation": "Pregnancy Category C. There are no adequate and well-controlled studies in pregnant women. Adefovir dipivoxil should be used during pregnancy only if clearly needed and after careful consideration of the risks and benefits. It is not known whether adefovir is excreted in human milk. Mothers should be instructed not to breast-feed if they are taking adefovir dipivoxil.",
            "Precautions & Warnings": "Patients who discontinued adefovir dipivoxil should be monitored at repeated intervals over a period of time for hepatic function. The patients at risk of or having underlying renal dysfunction should be monitored closely for renal function and may require dose adjustment.",
            "Use in Special Populations": "Pediatric use: Safety and effectiveness in pediatric patients have not been established.Geriatric use: In general, caution should be exercised when prescribing to elderly patients since they have greater frequency of decreased renal or cardiac function due to concomitant disease or other drug therapy.Dose Adjustment in Renal Impairment: the dosing interval of Adefovir should be adjusted in patients with baseline creatinine clearance <50 ml/min using the following suggested guidelines:\n\nCrCl ≤ 50 ml/min: 10 mg\nCrCl 20-49 ml/min: 10 mg every 48 hours\nCrCl 10-19 ml/min: 10 mg every 72 hours\nHaemodialysis patients: 10 mg every 7 days following dialysis",
            "Overdose Effects": "Doses of adefovir dipivoxil 500 mg daily for 2 weeks and 250 mg daily for 12 weeks have been associated with gastrointestinal side effects. If overdose occurs the patient must be monitored for evidence of toxicity and standard supportive treatment applied as necessary.",
            "Therapeutic Class": "Hepatic viral infections (Hepatitis B)",
            "Storage Conditions": "Store at cool and dry place. Protect from light and moisture. Keep all the medicines out of the reach of children."
        },
        {
            "name": "Adenosine",
            "link": "https://medex.com.bd/generics/23/adenosine",
            "Indications": "Intravenous Adenosine is indicated for the following: Conversion to sinus rhythm of paroxysmal supraventricular tachycardia (PSVT), including that associated with accessory bypass tracts (Wolff-Parkinson-White Syndrome).",
            "Pharmacology": "This preparation is a sterile, nonpyrogenic solution for rapid bolus intravenous injection. Adenosine injection slows conduction time through the A-V node, can interrupt the reentry pathways through the A-V node, and can restore normal sinus rhythm in patients with paroxysmal supraventricular tachycardia.",
            "Dosage & Administration": "Adult:\n\nInitial dose: 6 mg given as rapid IV bolus (administered over 1-2 second period).\nRepeat administration: If the first dose does not result in elimination of the supraventricular tachycardia within 1-2 minutes, 12 mg should be given as rapid intravenous bolus. This 12 mg dose may be repeated for second time if required.\n\nPediatric: The dosages used in neonates, infants, children and adolescents were equivalent to those administered to adults on a weight basis. \n\nBody weight < 50 kg: Initial dose - 0.05 to 0.1 mg/kg as a rapid IV bolus given either centrally or peripherally. A saline flush should follow.\nBody weight > 50 kg: The adult dose is recommended. Doses greater than 12 mg are not recommended for adult and pediatric patients.\n\nRepeat administration: If conversion of PSVT does not occur within 1-2 minutes, additional bolus injections of adenosine can be administered at incrementally higher doses, increasing the amount given by 0.05 to 0.1 mg/kg. A saline flush should follow. This process should continue until sinus rhythm is established or a maximum single dose of 0.3 mg/kg is used.",
            "Interaction": "Intravenous Adenosine injection has been effectively administered in the presence of other cardioactive drugs, such as Quinidine, beta- adrenergic blocking agents, Calcium channel blocking agents and angiotensin converting enzyme inhibitors without any change in the adverse reaction profile. Digoxin and Verapamil use may be rarely associated with ventricular fibrillation when combined with Adenosine. Because of the potential for additive or synergistic depressant effects on the SA and AV nodes, however, Adenosine should be used with caution in the presence of these agents. The use of Adenosine in patients receiving Digitalis may be rarely associated with ventricular fibrillation. The effects of Adenosine are antagonized by Methylxanthines, such as, Caffeine and Theophylline.",
            "Contraindications": "Intravenous Adenosine is contraindicated in: \n\nSecond- or third-degree A-V block (except in patients with a functioning artificial pacemaker).\nSinus node disease, such as sick sinus syndrome or symptomatic bradycardia (except in patients with a functioning artificial pacemaker).\nKnown hypersensitivity to Adenosine.",
            "Side Effects": "Cardiovascular: Facial flushing, headache, sweating, palpitations, chest pain, hypotension. Respiratory: Shortness of breath/dyspnea, chest pressure, hyperventilation, head pressure. Central Nervous System: Lightheadedness, dizziness, tingling in arms, numbness, apprehension, blurred vision, burning sensation, heaviness in arms, neck and back pain. Gastrointestinal: Nausea, metallic taste, tightness in throat, pressure in groin. In post-market clinical experience with Adenosine, cases of prolonged asystole, ventricular tachycardia, ventricular fibrillation, transient increase in blood pressure, bradycardia, hypotension, atrial fibrillation and bronchospasm, in association with Adenosine use, have been reported.",
            "Pregnancy & Lactation": "US FDA pregnancy category C. Animal reproduction studies have shown an adverse effect on the fetus and there are no adequate and well-controlled studies in humans, but potential benefits may warrant use of the drug in pregnant women despite potential risks.",
            "Overdose Effects": "The half-life of Adenosine is less than 10 seconds. Thus, adverse effects are generally rapidly self-limiting. Treatment of any prolonged adverse effects should be individualized and be directed toward the specific effect. Methylxanthines, such as, Caffeine and Theophylline, are competitive antagonists of Adenosine.",
            "Therapeutic Class": "Paroxysmal supraventricular tachycardia (PSVT)",
            "Storage Conditions": "Store in cool dry place protected from light. Keep out of reach of children. Do not refrigerate as crystallization may occur. If crystallization has occurred, dissolve crystals by warming to room temperature. The solution must be clear at the time of use."
        },
        {
            "name": "Adhatoda vasica + Centella asiatica",
            "link": "https://medex.com.bd/generics/1893/adhatoda-vasica-centella-asiatica",
            "Indications": "This syrup is indicated in-\n\nCough\nDry Cough\nBronchitis\nChronic lung infection\nRhinitis\nFlu & headache",
            "Composition": "Each 100 ml syrup contains extract of \n\nVasac (Adhatoda vasica) 5 gm\nThankuni (Centella asiatica) 20 gm",
            "Pharmacology": "Adhatoda vasica Contains alkaloid vasicine which has expectorant qualities so it is useful for bronchitis and other chest conditions of upper respiratory tract. The soothing action of vasac helps irritation in the throat and the expectorant action helps loosen phlegm deposits in the airway and expels it out. Honey reduces mucus secretion and cough.",
            "Dosage & Administration": "Children: 1/2-1 teaspoonful 2-3 times daily.Adult: 2-4 teaspoonful 2-3 times daily.Or as directed by the registered physician.",
            "Interaction": "There is no data available.",
            "Contraindications": "It is contraindicated in patients known to have hypersensitivity to the drug or any of its components.",
            "Side Effects": "There is no data available.",
            "Pregnancy & Lactation": "The safety of the Syrup in pregnancy & lactation has not been established. Therefore, it should be used with caution during pregnancy & lactation.",
            "Precautions & Warnings": "There is no data available.",
            "Storage Conditions": "Keep out of reach of children. Keep away from direct sunlight. Store in a cool and dry place."
        },
        {
            "name": "Adrenaline",
            "link": "https://medex.com.bd/generics/28/adrenaline",
            "Indications": "Adjunctive use in the management of cardiac arrest. It is used in cardiopulmonary resuscitation. Intracardiac puncture and intramyocardial injection of adrenaline may be effective when external cardiac compression and attempts to restore the circulation by electrical defibrillation or use of a pacemaker ... Read moreAdjunctive use in the management of cardiac arrest. It is used in cardiopulmonary resuscitation. Intracardiac puncture and intramyocardial injection of adrenaline may be effective when external cardiac compression and attempts to restore the circulation by electrical defibrillation or use of a pacemaker fail. Adrenaline is a drug that leads to increased blood pressure, increased heart rate, increased air entry, increased blood glucose, stimulates cardiac activity and reduces allergic reactions by reducing inflammatory response caused by histamine. Due to these properties, it is used for the treatment of allergic and anaphylactic reactions. Adrenaline is the favored treatment for anaphylactic shock and should be administered immediately if a person begins exhibiting severe allergic reactions. Adrenaline is also used in life threatening asthma when failing ventilation and continued deterioration despite nebulizer therapy.",
            "Description": "Adrenaline is a direct-acting sympathomimetic agent exerting its effect on alpha and beta-adrenoceptors. The overall effect of adrenaline depends on the dose, and may be complicated by the homeostatic reflex responses. In resuscitation procedures it is used to increase the efficacy of basic life support. It is a positive cardiac inotrope. Major effects are increased systolic blood pressure by arterioral and venous vasoconstriction (alpha1 effects), reduced diastolic pressure, tachycardia and hyperglycaemia. Adrenaline is rapid in onset and with short duration. After IV infusion the half-life is approximately 5-10 minutes. It is rapidly distributed to the heart, spleen, several glandular tissues and adrenergic nerves. Adrenaline is rapidly metabolised in the liver and tissues by oxidative de-amination and O- methylation followed by reduction or by conjugation with glucuronic acid or sulphate. Up to 90% of the IV dose is excreted in the urine as metabolites. It is approximately 50% bound to plasma proteins.",
            "Pharmacology": "The actions of epinephrine resemble the effects of stimulation of adrenergic nerves. It acts on both alpha and beta receptor sites of sympathetic effector cells. Its most prominent actions are on the beta receptors of the heart, vascular and other smooth muscle. When given by rapid intravenous injection, it produces a rapid rise in blood pressure, mainly systolic, by (1) direct stimulation of cardiac muscle which increases the strength of ventricular contraction, (2) increasing the heart rate and (3) constriction of the arterioles in the skin, mucosa and splanchnic areas of the circulation.When given by slow intravenous injection, epinephrine usually produces only a moderate rise in systolic and a fall in diastolic pressure. Although some increase in pulse pressure occurs, there is usually no great elevation in mean blood pressure. Accordingly, the compensatory reflex mechanisms that come into play with a pronounced increase in blood pressure do not antagonize the direct cardiac actions of epinephrine as much as with catecholamines that have a predominant action on alpha receptors.",
            "Dosage & Administration": "Cardiac arrest:\n\nIntravenous injection: 1 mg injection repeated every 2-3 minutes as necessary.\nEndotracheal: 2-3 mg via an endotracheal tube, repeated as necessary.\nIntracardiac: 0.1 to 1 mg, direct into the atrium of the heart.\nIntraspinal: Usual dose is 0.2 to 0.4 mg added to anesthetic spinal fluid mixture (to prolong anesthetic action by limiting absorption).\n\r\nAnaphylaxis, asthma or severe bronchospasm:\n\nAdult dose is 0.25 0.5 mg. It may be repeated at 5 minutes intervals until perfusion and respiratory status normalizes.\nIn case of dose dilution: 1 mg of Adrenaline to be diluted in 9 ml Normal Saline.\n\nChildren: Initially 10 mcg/kg body weight, not to exceed 250 mcg. May be repeated every 3-5 minutes if necessary. Subsequent doses should be 100 mcg/kg.",
            "Interaction": "Use of Adrenaline with excessive doses of digitalis, mercurial diuretics or other drugs that sensitize the heart to arrhythmias is not recommended. The adverse effects of Adrenaline may be potentiated by tricyclic antidepressants; certain antihistamines; e.g, Diphenhydramine, Tripelennamine, Chlorpheniramine and L-thyroxine Sodium.",
            "Contraindications": "Hypertension, arteriosclerosis, coronary disease and hyperthyroidism. Not to be given to patients taking monoamine oxidase inhibitors.",
            "Side Effects": "Common side effects are anxiety, restlessness, dizziness, headache, palpitations, rapid pulse, tremors, weakness and coldness of the extremities may be reported even with small doses and especially when given in conjunction with local anaesthetics.",
            "Pregnancy & Lactation": "Pregnancy Category C. It crosses the placenta and is excreted in breast milk. Adrenaline should only be used in pregnancy if the potential benefits outweigh the risks to the fetus. It is excreted in breast milk and therefore Adrenaline is not recommended for use during lactation because of the risk of adverse effects of infants.",
            "Precautions & Warnings": "The solution should not be used if it is pinkish or darker than slightly yellow or if it contains a precipitate. Adrenaline is readily destroyed by alkalies and oxidizing agents. In the latter category are Oxygen, Chlorine, Iodine, Permanganates, Chromates, Nitrites and salts of easily reducible metals, especially Iron. Adrenaline should not be mixed with Sodium bicarbonate; the solution is oxidised to adrenochrome and then forms polymers. Administer slowly with caution to elderly patients and to patients with ischemic heart disease, hypertension, diabetes mellitus, hyperthyroidism or psychoneurosis. Use with extreme caution in patients with long-standing bronchial asthma and emphysema who have developed degenerative heart disease. Anginal pain may be induced when coronary insufficiency is present.",
            "Overdose Effects": "Cardiac arrhythmia leading to ventricular fibrillation, severe hypertension leading to pulmonary edema and cerebral hemorrhage. Combined alpha and beta-adrenergic blocking agents such as Labetalol may counteract the effects of adrenaline, or a beta-blocking agent may be used to treat any supraventricular arrhythmias and Phentolamine to control the alpha-mediated effects on the peripheral circulation. Rapidly acting vasodilators such as nitrates and Sodium Nitroprusside may also be helpful. Immediate resuscitation support must be available.",
            "Therapeutic Class": "Anaphylaxis, Mydriatic and Cycloplegic agents, Other adrenoceptor stimulants, Respiratory stimulants: analeptics",
            "Storage Conditions": "Store below 25°C. Protect from light. Keep out of the reach of children."
        },
        {
            "name": "Adsorbed tetanus vaccine",
            "link": "https://medex.com.bd/generics/1057/adsorbed-tetanus-vaccine",
            "Indications": "For the active immunization of infants, children 7 years of age or older and adults against tetanus, wherever combined antigen preparations are not indicated.\nFor the prevention of neonatal tetanus in infants by immunizing women of childbearing age or infants bom of unvaccinated pregnant women. ... Read more\nFor the active immunization of infants, children 7 years of age or older and adults against tetanus, wherever combined antigen preparations are not indicated.\nFor the prevention of neonatal tetanus in infants by immunizing women of childbearing age or infants bom of unvaccinated pregnant women.\nThose who are liable to be exposed to tetanus infection and persons engaged in outdoor activities e.g. gardeners, agricultural, veterinary, athletes, industrial, sewage, road and outdoor workers, etc.\nThis vaccine is not to be used for the treatment of tetanus infection. If passive immunization is required, Tetanus Immunoglobulin (TIG) should be used.",
            "Pharmacology": "Tetanus toxoid adsorbed is a sterile suspension on aluminium phosphate suspended in an isotonic sodium chloride solution. The vaccine, after shaking, is a turbid liquid, whitish-gray in color. Adsorbed tetanus toxoid is prepared from tetanus toxin, produced by the growth of the bacterium Clostridium tetani in a peptone-based media. The toxin is converted to tetanus formol toxoid by treatment with formaldehyde solution. Formol tetanus toxoid is then purified, sterile, filtered and adsorbed to the aluminium phosphate.Thiomersal is added as preservative.",
            "Dosage": "Primary immunization for persons 7 years of age and older-\r\nA series of three doses of 0.5 ml each, of adsorbed tetanus vaccine should be given intramuscularly\n\nFirst dose: At appropriate date\nSecond dose: 4 to 8 weeks after the first dose\nThird dose: 6 to 12 months after the second dose\n\r\nChildren older than 7 years who did not complete primary immunization series (e.g., previously received only two doses of DTaP or DTP) need to receive only one dose of tetanus toxoid adsorbed vaccine to complete the primary series of tetanus. Interruption of the recommended schedule with a delay between doses does not interfere with the final immunity achieved with adsorbed tetanus vaccine. There is no need to start the series over again, regardless of the time elapsed between doses.Routine booster injections: To maintain adequate protection, a booster dose of 0.5 ml of adsorbed tetanus vaccine every 10 years thereafter is recommended.\nVaccination of injured persons-\r\nClean and minor wound:\n\nIf primary immunization confirmed and receiving booster dose within previous 5 years, no need of additional vaccine.\nIf primary immunization confirmed and receiving booster dose more than previous 5 years, 1 dose of 0.5 ml required.\n\r\nAll other dirty wounds (contaminated with feces, soil, and saliva):\n\nIf primary immunization confirmed and receiving booster dose within previous 5 years, 1 dose of 0.5 ml required.\nIf primary immunization confirmed and receiving booster dose more than previous 5 years, 1 dose of 0.5 ml along with tetanus immunoglobulin required.\n\r\nIf a person has no previous vaccination or uncertain, the primary series of 3 doses of 0.5ml adsorbed tetanus vaccine should be given along with tetanus immunoglobulin with 1st dose.\nProtection of neonatal tetanus-\r\nFor prevention of neonatal tetanus, adsorbed tetanus vaccine is recommended for immunization of women of childbearing age.Women (15-49 Years): For pregnant woman who have not had previous immunization, 2 doses of tetanus toxoid at four weeks interval preferably during the last two trimester or at least 2 weeks before delivery should be given during pregnancy so that protective antibody would be transferred to the infant in order to prevent neonatal tetanus, e.g. 1 dose of 0.5 ml at 6th month of pregnancy and 1 dose of 0.5 ml at 7th month of pregnancy. Pregnant woman who have completed the course of tetanus, next 10 years no need of additional dose during pregnancy. Thereafter a single booster dose would be sufficient to extend immunity.",
            "Administration": "Method of administration: Adsorbed Tetanus Vaccine is for intramuscular injection only. Do not inject intravenously. For adults and older children Adsorbed Tetanus Vaccine should be given intramuscularly in the deltoid muscle. For infants Adsorbed Tetanus Vaccine should be given intramuscularly in the anterolateral aspect of the upper thigh. It should not be injected into the gluteal areas as the immune response may be lower. The attending physician should determine final selection of the injection site and needle size, depending upon the patient's age and the size of the target muscle. The vaccine should be shaken well before use to obtain a homogenous turbid white suspension. Please do not shake vigorously.Preparation for administration:\n\nThe vaccine should be shaken well before use to obtain a homogenous turbid white suspension. Please do not shake vigorously.\nThe vaccine should be inspected visually for particulate matter and discoloration prior to administration. If either of these conditions exist, the vaccine should not be administered.\nThe vaccine should be used as supplied; no dilution is necessary.\nThe full recommended dose of the vaccine should be used. Any vaccine remaining in a single-dose ampoule/vial should be discarded.\n\nCo-administration: Adsorbed tetanus vaccine can be given at the same time with other vaccine as diphtheria, tetanus, pertussis (DTP), polio (OPV), measles, mumps and rubella (MMR), Haemophilus Influenzae type b (Hib) and Meningococcal vaccines at separate sites with separate syringes. It should not be mixed with other vaccines or medicinal products in the same syringe.",
            "Interaction": "Decreased immunologic response with concurrent immunosuppressants. Neutralisation of tetanus immune globulin and tetanus toxoid adsorbed if not given at different sites using different syringes.",
            "Contraindications": "Hypersensitivity to any component of the vaccine, including thiomersal, is a contraindication. This vaccine is contraindicated in patients with previous hypersensitivity to any tetanus-containing vaccine. Tetanus toxoid vaccination should be defferred during the course of any febrile illness or acute infection. A minor febrile illness such as a mild upper respiratory infection should not preclude immunization.",
            "Side Effects": "Adsorbed tetanus vaccine is generally well tolerated. Most recipients of tetanus vaccine experience some reactions upon vaccination. These are generally moderate and short in duration. They mainly consist of local reactions at the injection site (erythema, induration and tenderness). Systemic reactions (malaise and elevated temperature) are reported less commonly.",
            "Pregnancy & Lactation": "For protection of neonatal tetanus, tetanus toxoid is recommended for immunization of women of childbearing age and especially pregnant women. Tetanus toxoid may be safely administered during pregnancy and should be given to the mother at first contact or as early as possible. It is not known if tetanus toxoid is excreted in human milk. It may be administered to nursing mothers only if clearly needed.",
            "Precautions & Warnings": "Do not administer IV. Use subcutaneous route in bleeding disorders. Withhold vaccination in moderate or severe febrile illness. Pregnancy, lactation, history of Guillian-Barre syndrome.",
            "Therapeutic Class": "Vaccines, Anti-sera & Immunoglobulin",
            "Storage Conditions": "Keep out of the reach and sight of children. Store at +2°C to +8°C. Transportation should also be at +2°C to +8°C. Do not freeze. Discard vaccine if frozen. Protect from light."
        },
        {
            "name": "Afatinib Dimaleate",
            "link": "https://medex.com.bd/generics/1849/afatinib-dimaleate",
            "Indications": "EGFR Mutation-Positive, Metastatic Non-Small Cell Lung Cancer: Afatinib is indicated for the first-line treatment of patients with metastatic non-small cell lung cancer (NSCLC) whose tumors have non-resistant epidermal growth factor receptor (EGFR) mutations as detected by an FDA-approved ... Read moreEGFR Mutation-Positive, Metastatic Non-Small Cell Lung Cancer: Afatinib is indicated for the first-line treatment of patients with metastatic non-small cell lung cancer (NSCLC) whose tumors have non-resistant epidermal growth factor receptor (EGFR) mutations as detected by an FDA-approved test.Limitation of Use: The safety and efficacy of Afatinib have not been established in patients whose tumors have resistant EGFR mutations.Previously Treated, Metastatic Squamous NSCLC: Afatinib is indicated for the treatment of patients with metastatic squamous NSCLC progressing after platinum-based chemotherapy.",
            "Pharmacology": "Afatinib covalently binds to the kinase domains of EGFR (ErbB1), HER2 (ErbB2), and HER4 (ErbB4) and irreversibly inhibits tyrosine kinase autophosphorylation, resulting in downregulation of ErbB signaling. Certain mutations in EGFR, including non-resistant mutations in its kinase domain, can result in increased autophosphorylation of the receptor, leading to receptor activation, sometimes in the absence of ligand binding, and can support cell proliferation in NSCLC. Non-resistant mutations are defined as those occurring in exons constituting the kinase domain of EGFR that lead to increased receptor activation and where efficacy is predicted by 1) clinically meaningful tumor shrinkage with the recommended dose of afatinib and/or 2) inhibition of cellular proliferation or EGFR tyrosine kinase phosphorylation at concentrations of afatinib sustainable at the recommended dosage according to validated methods. The most commonly found of these mutations are exon 21 L858R substitutions and exon 19 deletions.Afatinib demonstrated inhibition of autophosphorylation and/or in vitro proliferation of cell lines expressing wild type EGFR and in those expressing selected EGFR exon 19 deletion mutations, exon 21 L858R mutations, or other less common non-resistant mutations, at afatinib concentrations achieved in patients. In addition, afatinib inhibited in vitro proliferation of cell lines overexpressing HER2.Treatment with afatinib resulted in inhibition of tumor growth in nude mice implanted with tumors either overexpressing wild type EGFR or HER2 or in an EGFR L858R/T790M double mutant model.",
            "Dosage & Administration": "Patient Selection for Non-Resistant EGFR Mutation-Positive Metastatic NSCLC: Select patients for first line treatment of metastatic NSCLC with Afatinib based on the presence of non-resistant EGFR mutations in tumor specimens.Recommended Dose: The recommended dose of Afatinib is 40 mg orally, once daily until disease progression or no longer tolerated by the patient.Renal impairment: 30 mg orally, once daily in patients with severe renal impairment.Instruct patients to take Afatinib at least 1 hour before or 2 hours after a meal.",
            "Interaction": "Co-administration of P-gp inhibitors can increase afatinib exposure. Reduce Afatinib by 10 mg per day if not tolerated. Co-administration of chronic P-gp inducers orally can decrease afatinib exposure. Increase Afatinib by 10 mg per day as tolerated.",
            "Side Effects": "Most common adverse reactions (≥20%) were diarrhea, rash/acneiform dermatitis, stomatitis, paronychia, dry skin, decreased appetite, nausea, vomiting, pruritus.",
            "Pregnancy & Lactation": "Based on findings from animal studies and its mechanism of action, Afatinib can cause fetal harm when administered to a pregnant woman. There are no available data on the use of Afatinib in pregnant women. Administration of afatinib to pregnant rabbits during organogenesis at exposures approximately 0.2 times the exposure in humans at the recommended dose of 40 mg daily resulted in embryotoxicity and, in rabbits showing maternal toxicity, increased abortions at late gestational stages [see Data]. Advise a pregnant woman of the potential risk to a fetus. The background risk of major birth defects and miscarriage for the indicated population is unknown. In the U.S. general population, the estimated background risk of major birth defects and miscarriage in clinically recognized pregnancies is 2 to 4% and 15 to 20%, respectively.There are no data on the presence of afatinib in human milk or its effects on the breastfed infant or on milk production. Afatinib was present in the milk of lactating rats. Because of the potential for serious adverse reactions in nursing infants from Afatinib, advise a lactating woman not to breastfeed during treatment with Afatinib and for 2 weeks after the final dose.",
            "Precautions & Warnings": "Diarrhea: Diarrhea may result in dehydration and renal failure. Withhold afatinib for severe and prolonged diarrhea not responsive to anti-diarrheal agents.Bullous and exfoliative skin disorders: Severe bullous, blistering, and exfoliating lesions occurred in 0.2% of patients. Discontinue for life-threatening cutaneous reactions. Withhold afatinib for severe and prolonged cutaneous reactions.Interstitial lung disease (ILD): Occurs in 1.6% of patients. Withhold afatinib for acute onset or worsening of pulmonary symptoms. Discontinue afatinib if ILD is diagnosed.Hepatic toxicity: Fatal hepatic impairment occurs in 0.2% of patients. Monitor with periodic liver testing. Withhold or discontinue afatinib for severe or worsening liver tests.Keratitis: Occurs in 0.7% of patients. Withhold afatinib for keratitis evaluation. Withhold or discontinue afatinib for confirmed ulcerative keratitis.Embryo-fetal toxicity: Can cause fetal harm when administered to a pregnant woman. Advise pregnant women and females of reproductive potential of the potential risk to the fetus and to use effective contraception.",
            "Therapeutic Class": "Tyrosine Kinase Inhibitor",
            "Storage Conditions": "Store at 25°C; excursions permitted to 15°-30°C. Dispense medication in the original container to protect from exposure to high humidity and light."
        },
        {
            "name": "Aflibercept",
            "link": "https://medex.com.bd/generics/1287/aflibercept",
            "Indications": "Aflibercept, in combination with 5-fluorouracil, leucovorin, irinotecan-(FOLFIRI), is indicated for patients with metastatic colorectal cancer (mCRC) that is resistant to or has progressed following an oxaliplatin-containing regimen.",
            "Pharmacology": "Ablibercept is a recombinant fusion protein that acts as a decoy receptor for the ligands, vascular endothelial growth factor-A (VEGF-A) and placental growth factor (PIGF). It prevents these ligands to binding to endothelial receptors, VEGFR-1 and VEGFR-2, to suppress neovascularization and decrease vascular permeability. This ultimately will slow vision loss or the progression of metastatic colorectal cancer.",
            "Dosage": "4 mg/kg as an intravenous infusion over 1 hour every 2 weeks. Do not administer as an intravenous (IV) push or bolus.",
            "Administration": "Preparation for Administration: Inspect vials visually prior to use. Aflibercept is a clear, colorless to pale yellow solution. Do not use vial if the solution is discolored or cloudy or if the solution contains particles. Do not re-enter the vial after the initial puncture. Discard any unused portion left in the vial. Withdraw the prescribed dose of Aflibercept and dilute in 0.9% sodium chloride solution, 5% dextrose solution for injection, to achieve a final concentration of 0.6–8 mg/mL.Use polyvinyl chloride (PVC) infusion bags containing bis (2-ethylhexyl) phthalate (DEHP) or polyolefin infusion bags. Store diluted Aflibercept at 2°–8°C for up to 24 hours, or at controlled room temperature 20°–25°C for up to 8 hours. Discard any unused portion left in the infusion bag.Administration: Administer the diluted Aflibercept solution as an intravenous infusion over 1 hour through a 0.2 micron polyethersulfone filter. Do not use filters made of polyvinylidene fluoride (PVDF) or nylon. Do not administer as an intravenous (IV) push or bolus. Do not combine Aflibercept with other drugs in the same infusion bag or intravenous line.",
            "Interaction": "No dedicated drug-drug interaction studies have been conducted for Aflibercept. No clinically important pharmacokinetic drug-drug interactions were found between ziv-aflibercept and irinotecan/SN-38 or 5-FU, based on cross-study comparisons and population pharmacokinetic analyses.",
            "Side Effects": "Most common adverse reactions (all grades, ≥20% incidence and at least 2% greater incidence for the Aflibercept/FOLFIRI regimen) were leukopenia, diarrhea, neutropenia, proteinuria, AST increased, stomatitis, fatigue, thrombocytopenia, ALT increased, hypertension, weight decreased, decreased appetite, epistaxis, abdominal pain, dysphonia, serum creatinine increased, and headache",
            "Pregnancy & Lactation": "Pregnancy category C. There are no adequate and well-controlled studies with Aflibercept in pregnant women. Aflibercept was embryotoxic and teratogenic in rabbits at exposure levels lower than human exposures at the recommended dose, with increased incidences of external, visceral, and skeletal fetal malformations. Aflibercept should be used during pregnancy only if the potential benefit justifies the potential risk to the fetus.It is not known whether Aflibercept is excreted in human milk. Because many drugs are excreted in human milk and because of the potential for serious adverse reactions in nursing infants from Aflibercept, a decision should be made whether to discontinue nursing or discontinue the drug, taking into account the importance of the drug to the mother.",
            "Precautions & Warnings": "Adverse reactions, sometimes severe and life-threatening or fatal, have been seen in clinical trials with Aflibercept, including:\n\nFistula Formation: Discontinue Aflibercept if fistula occurs.\nHypertension: Monitor blood pressure and treat hypertension. Temporarily suspend Aflibercept if hypertension is not controlled. Discontinue Aflibercept if hypertensive crisis develops.\nArterial Thromboembolic Events (ATE) (e.g., transient ischemic attacks, cerebrovascular accident, angina pectoris): Discontinue Aflibercept if ATE develops.\nProteinuria: Monitor urine protein. Suspend Aflibercept when proteinuria ≥ 2 grams per 24 hours. Discontinue Aflibercept if nephrotic syndrome or thrombotic microangiopathy (TMA) develops.\nNeutropenia and Neutropenic Complications: Delay administration of Aflibercept/FOLFIRI until neutrophil count is ≥ 1.5 × 109/L.\nDiarrhea and Dehydration: Incidence of severe diarrhea and dehydration is increased. Monitor elderly patients more closely.\nReversible Posterior Leukoencephalopathy Syndrome (RPLS): Discontinue Aflibercept.",
            "Use in Special Populations": "Pediatric Use: The safety and effectiveness in pediatric patients have not been established. In a dose-escalation, safety, and tolerability study, 21 patients ages 2 to 21 years (median age 12.9) with solid tumors received Aflibercept at doses ranging from 2 to 3 mg/kg, IV, every two weeks. The pharmacokinetics of free ziv-aflibercept were evaluated in 8 of these patients (ages 5 to 17 years). The maximum tolerated dose in the study was 2.5 mg/kg, below the dose known to be safe and effective in adults with mCRC.Geriatric Use: Of the 611 patients with mCRC, patients treated with Aflibercept/FOLFIRI, 205 (34%) were 65 years or older, and 33 (5%) were 75 years or older. Elderly patients (≥65 years of age) experienced higher incidences (≥5%) of diarrhea, dizziness, asthenia, weight decrease, and dehydration when compared to younger patients. Monitor elderly patients more closely for diarrhea and dehydrationThe effect of Aflibercept on overall survival was similar in patients <65 years old and ≥65 years old who received Aflibercept/FOLFIRI. No dose adjustment of Aflibercept is recommended for patients greater than or equal to 65 years of age.Hepatic Impairment: No dedicated clinical studies have been conducted to evaluate the effect of hepatic impairment on the pharmacokinetics of ziv-aflibercept. Based on a population PK analysis with data from 1507 patients, ziv-aflibercept exposure in patients with mild and moderate hepatic impairment were similar to those in patients with normal hepatic function. There are no data available for patients with severe hepatic impairment.Renal Impairment: No dedicated clinical studies have been conducted to evaluate the effect of renal impairment on the pharmacokinetics of ziv-aflibercept. Based on a population PK analysis with data from 1507 patients, ziv-aflibercept exposure in patients with mild, moderate, and severe renal impairment were similar to those in patients with normal renal function [see Clinical Pharmacology.Females and Males of Reproductive Potential: Male and female reproductive function and fertility may be compromised during treatment with Aflibercept, as suggested by findings in monkeys [see Nonclinical Toxicology. These animal findings were reversible within 18 weeks after cessation of treatment. Females and males of reproductive potential should use highly effective contraception during and up to a minimum of 3 months after the last dose of treatment.",
            "Overdose Effects": "There have been no cases of overdose reported with Aflibercept. There is no information on the safety of Aflibercept given at doses exceeding 7 mg per kg every 2 weeks or 9 mg per kg every 3 weeks.",
            "Therapeutic Class": "Cytotoxic Chemotherapy",
            "Storage Conditions": "Store Aflibercept vials in a refrigerator at 2 to 8° C . Keep the vials in the original outer carton to protect from light."
        },
        {
            "name": "Agomelatine",
            "link": "https://medex.com.bd/generics/35/agomelatine",
            "Indications": "Agomelatine is indicated for:\n\nMajor depressive disorder especially in non-responders and intolerant to SSRIs\nGeneralized anxiety disorder\nBipolar depression\nSleep disturbances\nSeasonal affective disorder\nMigraine and cluster headaches",
            "Pharmacology": "This compound binds to the melatoninergic receptors and the serotoninergic 5-HT2c receptor giving rise to the Melatonin Agonist and Selective Serotonin Antagonist (MASSA) concept. The melatoninergic receptors MT1 and MT2, are G protein coupled receptors and they act through decreasing cAMP and cGMP. Agomelatine strongly binds to and stimulates the activity of MT1 and MT2 receptors normalizing the disturbed circadian rhythms and disrupted sleep-wake cycles. Unlike the existing antidepressants, agomelatine does not inhibit the uptake of serotonin, norepinephrine or dopamine. It inhibits 5HT-2C receptor (G protein coupled receptor which increases IP3/DAG secondary messenger system) found abundantly in the SCN, frontal cortex, hippocampus and basal ganglia involved in the mood, motor and cognitive deficits associated with depressive states. 5HT-2C receptor antagonism increases norepinephrine and dopamine levels in the frontal cortex of the brain. This action of agomelatine produces antidepressant, antianxiety and also increases slow-wave sleep which is decreased in depression. It has been observed that it can increase neurogenesis in the hippocampus and may also have neuroprotective effects (by influencing glutamate release, glucocorticoid receptor gene expression and various neurotropic factors) which might also contribute to its antidepressant effects. A study has shown that agomelatine alleviates sleep disturbances after one week of therapy and by two weeks antidepressant effects manifest. The combined actions of agomelatine at MT1, MT2, and 5HT-2C receptors can improve the disturbed circadian rhythm and abnormal sleep pattern thus produce the antidepressant effect. These unique effects suggest that it might be effective for the treatment of seasonal affective disorder like anxiety and bipolar depression.",
            "Dosage": "The effective dose of agomelatine is 25 mg per day given once at bed time for two weeks and can be increased to 50 mg per day in patients with inadequate response. Night time dosing is recommended because agomelatine improves the quality of sleep without day time sedation.",
            "Administration": "For oral administration with or without food. Most adult patients should take a dosage of 25 mg (one tablet) daily. It is usually taking prior to bed time. If no improvement is noticed after two weeks, the dosage can be increased to 50 mg (two tablets) daily.",
            "Interaction": "Potential interactions affecting agomelatine: Agomelatine is metabolised mainly by cytochrome P450 1A2 (CYP1A2) (90%) and by CYP2C9 (10%). Medicinal products that interact with these isoenzymes may decrease or increase the bioavailability of agomelatine. Fluvoxamine, a potent CYP1A2 and moderate CYP2C9 inhibitor markedly inhibits the metabolism of agomelatine resulting in a 60-fold (range 12-412) increase of agomelatine exposure. Consequently, co-administration of agomelatine with potent CYP1A2 inhibitors (e.g. fluvoxamine, ciprofloxacin) is contraindicated.",
            "Contraindications": "It is contraindicated in patients with hepatic impairment and hypersensitivity to the active substances or any of the excipients.",
            "Side Effects": "The commonly reported adverse effects in the clinical trials of agomelatine are headache, nausea and diarrhea.",
            "Pregnancy & Lactation": "For agomelatine, no clinical data on exposed pregnancies are available. Animal studies do not indicate direct or indirect harmful effects with respect to pregnancy, embryonal/foetal development, parturition or postnatal development (see Toxicology: Preclinical Safety Data under Actions). Caution should be exercised when prescribing to pregnant women. It is not known whether Agomelatine is excreted into human milk. agomelatine or its metabolites are excreted in the milk of lactating rats. Potential effects of agomelatine on the breastfeeding infant have not been established. If treatment with agomelatine is considered necessary, breastfeeding should be discontinued.",
            "Precautions & Warnings": "It is found to increase the level of liver enzymes and so monitoring of enzyme level is warranted before starting therapy and therefore every 6 weeks.",
            "Use in Special Populations": "Children under 18 years: Should be given only on medical advice.Children and adolescents: Agomelatine is not recommended in the treatment of depression in patients .Use in the elderly: Efficacy has not been clearly demonstrated in the elderly (65 years). Only limited clinical data is available on the use of Agomelatine in elderly patients 65 years with major depressive episodes. Therefore, caution should be exercised when prescribing Agomelatine to these patients.",
            "Overdose Effects": "There is limited experience with agomelatine overdose. During the clinical development, there were a few reports of agomelatine overdose, taken alone (up to 450 mg) or in combination (up to 525 mg) with other psychotropic medicinal products. Signs and symptoms of overdose were limited and included drowsiness and epigastralgia. No specific antidotes for agomelatine are known. Management of overdose should consist of treatment of clinical symptoms and routine monitoring. Medical follow-up in a specialised environment is recommended.",
            "Therapeutic Class": "Atypical anti-depressant drugs",
            "Storage Conditions": "Store in a cool and dry place away from light. Keep out of the reach of children."
        },
        {
            "name": "Albendazole",
            "link": "https://medex.com.bd/generics/16/albendazole",
            "Indications": "Albendazole is indicated in single and mixed infestations of-\n\nHookworm (Ancylostoma, Necator)\nRoundworm (Ascaris)\nThreadworm (Enterobius)\nWhipworm (Trichuris)\nStrongyloides\nTapeworm\nOpisthorchi\nHydatid.",
            "Description": "Albendazole is a benzimidazole anthelmintic, active against most nematodes and some cestodes. It is used in the treatment of intestinal nematode infections and in higher doses in the treatment of hydatid disease. Albendazole exhibits vermicidal, ovicidal, and larvicidal activity. The principal mode of action of Albendazole is its inhibitory effect on tubulin polymerization, which results in the loss of cytoplasmic microtubules.",
            "Pharmacology": "Albendazole is a broad spectrum anthelmintic. Albendazole exhibits vermicidal, ovicidal and larvicidal activities. The drug is thought to exert its anthelmintic effect by blocking glucose uptake in the susceptible helminths, thereby depleting the energy level until it becomes inadequate for survival. Immobilization is followed by the parasite. These events may be a consequence of the binding and subsequent inhibition of parasite tubulin polymerization by Albendazole and its metabolites, although the drug also binds to human tubulin. Albendazole is extensively metabolized, probably in the liver. Albendazole is poorly absorbed from the gastrointestinal tract but rapidly undergoes extensive first-pass metabolism. The principal metabolite albendazole sulphoxide has anthelmintic activity and a plasma half-life of about 8.5 hrs. It is excreted in the urine together with other metabolites.",
            "Dosage & Administration": "Adults & children over 2 years: \n\n400 mg (1 tablet or 10 ml suspension) as a single dose in cases of Enterobius vermicularis, Trichuris trichiura, Ascaris lumbricoides, Ancylostoma duodenale and Necator americanus.\nIn cases of strongyloidiasis or taeniasis, 400 mg (1 tablet or 10 ml suspension) daily should be given for 3 consecutive days. If the patient is not cured on follow-up after three weeks, a second course of treatment is indicated. \n\nChildren of 1-2 years: Recommended dose is a single dose of 200 mg (5 ml suspension).Children under 1 year: Not recommended.In Hydatid disease (Echinococcosis): \n\nAlbendazole is given by mouth with meals in a dose of 400 mg twice daily for 28 days for patients weighing over 60 kg.\nA dose of 15 mg/kg body weight daily in two divided doses (to a maximum total daily dose of 800 mg) is used for patients weighing less than 60 kg.\nFor cystic echinococcosis, the 28 days course may be repeated after 14 days without treatment, to a total of 3 treatment cycles.\nFor alveolar echinococcosis, cycles of 28 days of treatment followed by 14 days without treatment, may need to continue for months or years.\nIn giardiasis, 400 mg (1 tablet or 10 ml suspension) once daily for five days is used.",
            "Interaction": "No interaction involving Albendazole, either pharmacodynamic or pharmacokinetic, has been reported.",
            "Contraindications": "Neonates: Albendazole is not normally used in neonates.Children: Reduction of the dose from 400 mg to 200 mg may be indicated in children weighing less than 10 kg but there are no grounds for a general reduction in dosage to children.Pregnant woman: Albendazole should not be given during pregnancy or women thought to be pregnant. No information is available on placental transfer.Concurrent disease: There is no evidence to suggest that dose should be altered in renal, hepatic or cardiac failure.",
            "Side Effects": "Gastrointestinal disturbances, headache, dizziness, changes in liver enzymes, rarely reversible alopecia; rash, fever, blood disorders including leucopenia and pancytopenia reported; allergic shock if cyst leakage; convulsion and meningism in cerebral disease.",
            "Pregnancy & Lactation": "US FDA Pregnancy category of Albendazole is C. So, Albendazole should be avoided in pregnancy and lactation unless the potential benefits to the other outweigh the possible risks to the fetus.",
            "Precautions & Warnings": "Blood counts and liver function tests before treatment and twice during each cycle; breastfeeding; exclude pregnancy before starting treatment. Albendazole should only be used in the treatment of Echinococcosis if there is constant medical supervision with regular monitoring of serum-transaminase concentrations and of leucocyte and platelet counts",
            "Therapeutic Class": "Anthelmintic",
            "Storage Conditions": "Keep in a dry place, away from light and heat. Keep out of the reach of children."
        },
        {
            "name": "Albumin (Human)",
            "link": "https://medex.com.bd/generics/545/albumin-human",
            "Indications": "Shock: Albumin is indicated in the emergency treatment of shock and in other similar conditions where the restoration of blood volume is urgent. If there has been considerable loss of red blood cells, transfusion with packed red blood cells is indicated.... Read moreShock: Albumin is indicated in the emergency treatment of shock and in other similar conditions where the restoration of blood volume is urgent. If there has been considerable loss of red blood cells, transfusion with packed red blood cells is indicated.Burns: Albumin or Albumin in either normal saline or dextrose is indicated to prevent marked hemoconcentration and to maintain appropriate electrolyte balance.Hypoproteinemia with or without edema: Albumin is indicated in those clinical situations usually associated with a low concentration of plasma protein and a resulting decreased circulating blood volume. Although diuresis may occur soon after albumin administration has been instituted, best results are obtained if albumin is continued until the normal serum protein level is regained.",
            "Pharmacology": "The main function of albumin results from its contribution to plasma colloid oncotic pressure and transport function. Albumin stabilizes circulating blood volume and carries hormones, enzymes, medicines, and toxins. Other physiological functions include antioxidant properties, free radical scavenging, in addition to maintenance capillary membrane integrity. Exogenously administered albumin increases the oncotic pressure of the intravascular system, moving fluids from the interstitial space, thereby decreasing edema and increasing the circulating blood volume. The increase in volume reduces the concentration and viscosity of blood in patients with decreased circulating blood volume while maintaining cardiac output in shock. In dehydrated patients, negligible effects exist on circulating blood volume. In addition to the above albumin replaces protein in patients with hypoproteinemia until the cause of the deficiency can be determined.This drug has thousands of endogenous and exogenous targets. Human albumin also binds and carries a plethora of hydrophobic molecules, such as endogenous (i.e., cholesterol, fatty acids, bilirubin, thyroxine) or exogenous substances (for example, drugs and toxins), transition metal ions, as well as gas (nitric oxide [NO]), with resulting implications for their solubilisation, transport, metabolism, and detoxification.",
            "Dosage & Administration": "Human albumin 25% is for intravenous administration only. Human albumin may be diluted with 5% glucose or 0.9% sodium chloride. Concentration, dosage, and infusion-rate should be adjusted to the patient’s individual requirements and indication.\n\nHypovolemia: Initial dose 25 g is suggested.\nHypoalbuminemia: 50-75 gm\nPrevention of central volume fluid removed depletion after\nparacentesis due to cirrhotic ascites: 6-8 gm for every 1000 mL of ascitic.\nOHSS: 50 to 100 gm over 4 hours and repeated at 4-12 hour intervals as necessary. 10-50 gm; single infusion.\nARDS: 25 g over 30 minutes and repeated at 8 hours for 3 days if necessary.\nBurns: Determined by direct observation of vital sign or measurement of either plasma oncotic pressure or protein content.\n\nHuman albumin 20%: Measures of adequacy of circulating volume and not plasma albumin levels should be used to determine the dose required. If human albumin is to be administered, haemodynamic performance should be monitored regularly; this may include:\n\narterial blood pressure and pulse rate\ncentral venous pressure\npulmonary artery wedge pressure\nurine output\nelectrolyte\nhaematocrit / haemoglobin\n\r\nThe solution can be directly administered by the intravenous route, or it can be diluted in an isotonic solution (e.g. 0.9% sodium chloride). In plasma exchange the infusion rate should be adjusted to the rate of removal.Human albumin 5% may be given intravenously without further dilution. This concentration is approximately isotonic and iso-osmotic with citrated plasma. Albumin (Human) in this concentration provides additional fluid for plasma volume expansion. Therefore, when it is administered to patients with normal blood volume, the rate of infusion should be slow enough to prevent too rapid expansion of plasma volume.In the treatment of shock in an adult patient an initial dose of 500 mL of the 5% albumin solution is given as rapidly as tolerated. If response within 30 minutes is inadequate, an additional 500 mL of 5% albumin solution may be given. The 50 mL dosage form would be appropriate for pediatric use, with a dose of 10-20 mL per kg of body weight infused intravenously at a rate up to 5-10 mL per minute. Therapy should be guided by the clinical response, blood pressure and an assessment of relative anemia. If more than 1000 mL are given, or if hemorrhage has occurred, the administration of packed red blood cells may be desirable.In severe burns, immediate therapy should include large volumes of crystalloid with lesser amounts of 5% albumin solution to maintain an adequate plasma volume. After the first 24 hours, the ratio of albumin to crystalloid may be increased to establish and maintain a plasma albumin level of about 2.5 g/100 mL or a total serum protein level of about 5.2 g/100 mL. However, an optimal regimen for the use of colloids, electrolytes and water after severe burns has not been established.The infusion of Albumin (Human) as a nutrient in the treatment of chronic hypoproteinemia is not recommended. In acute hypoproteinemia, 5% albumin may be used in replacing the protein lost in hypoproteinemic conditions. However, if edema is present or if large amounts of albumin are lost, Albumin (Human) 25% is preferred because of the greater amount of protein in the concentrated solution. Parenteral drug products should be inspected visually for particulate matter and discoloration prior to administration, whenever solution and container permit.",
            "Interaction": "Albumin solution should not be mixed by protein hydrolysates or alcoholic solutions. Risk of atypical reactions to ACE inhibitors in patients undergoing therapeutic plasma exchange with albumin human replacement.",
            "Contraindications": "Albumin (Human) may be contraindicated in patients with severe anemia or cardiac failure and in patients with a history of allergic reactions to human albumin.",
            "Side Effects": "Allergic or pyrogenic reactions are characterized primarily by fever and chills; rash, nausea, vomiting, tachycardia and hypotension have also been reported. Should an adverse reaction occur, slow or stop the infusion for a period of time which may result in the disappearance of the symptoms. If administration has been stopped and the patient requires additional Albumin (Human), material from a different lot should be used. Albumin (Human), particularly if administered rapidly, may result in vascular overload with resultant pulmonary edema.",
            "Pregnancy & Lactation": "Pregnancy Category C. Either studies in animals have revealed adverse effects on the foetus (teratogenic or embryocidal or other) and there are no controlled studies in women or studies in women and animals are not available. Drugs should be given only if the potential benefit justifies the potential risk to the foetus.",
            "Precautions & Warnings": "Hypertension or low cardiac reserve; additional fluids for dehydrated patients. Monitor for signs of cardiac overload in injured or postoperative patients. May carry risk of viral transmission. Volume admin and rate of infusion must always be individualised according to situation and response. Pregnancy, lactation.",
            "Use in Special Populations": "No clinical studies using Albumin (Human) have been conducted in pediatric patients. Safety and effectiveness in pediatric patients have not been established. However, extensive experience in patients suggests that children respond to Albumin (Human) in the same manner as adults.",
            "Therapeutic Class": "Plasma expanders",
            "Storage Conditions": "Store below 30°C. Do not freeze."
        },
        {
            "name": "Alcaftadine",
            "link": "https://medex.com.bd/generics/29/alcaftadine",
            "Indications": "Alcaftadine eye drops is indicated for the prevention of itching associated with allergic conjunctivitis. Alcaftadine ophthalmic solution is an H1 receptor antagonist, in a sterile ophthalmic solution for topical ophthalmic use.",
            "Pharmacology": "This eye drops is a sterile topical ophthalmic solution containing Alcaftadine. Alcaftadine is an histamine receptor antagonist and inhibitor of the release of histamine from mast cell. It is also a potent histamine H2 and H4 receptor antagonist that has demonstrated anti-inflammatory property. In doing so, antihistaminic effect provides relief from itching associated with early phase of ocular allergic response, whereas mast cell stabilization inhibits the release of mediators such as cytokines and lipid mediators that play a role in late-phase response of allergic conjunctivitis.",
            "Dosage & Administration": "Adults and children 2 years and over: Instill one drop in each eye once daily.",
            "Contraindications": "Alcaftadine is contraindicated in patients with hypersensitivity to any component in the product.",
            "Side Effects": "The most frequent ocular reactions are eye irritation, burning or/and stinging upon instillation, eye redness and eye pruritus, nasopharyngitis and headache.",
            "Pregnancy & Lactation": "Pregnancy category B. There are however, no adequate and well controlled studies in pregnant women, thus this drug should be used during pregnancy only if clearly needed. It is not known whether this drug is excreted in human milk. Caution should be exercised while administered to a nursing woman.",
            "Precautions & Warnings": "To minimize eye injury and contamination of the dropper tip and solution, care should be taken not to touch the eyelids or surrounding areas with the dropper tip of the bottle. Patients should be advised not to wear a contact lens if their eye is red. This preparation should not be used to treat contact lens related irritation and should not be instilled while wearing contact lenses. Remove contact lenses prior to instillation this preparation. Lenses may be reinserted after 10 minutes following administration. If more than 1 topical ophthalmic medicinal product is being used, each one should be administered at least 5 minutes apart.",
            "Use in Special Populations": "Pediatric Use: Safety and effectiveness in pediatric patients below the age of 2 years have not been established.Geriatric Use: No overall differences in safety or effectiveness were observed between elderly and younger subjects.",
            "Therapeutic Class": "Ophthalmic Anti-allergic preparations",
            "Storage Conditions": "Store in a cool (15°C - 25°C) and dry place protected from light. Do not use after one month once the cap is opened."
        },
        {
            "name": "Alectinib",
            "link": "https://medex.com.bd/generics/1501/alectinib",
            "Indications": "Alectinib indicated for the treatment of patients with anaplastic lymphoma kinase (ALK)-positive, locally advanced or metastatic non-small cell lung cancer (NSCLC) who have progressed on or are intolerant to crizotinib.",
            "Pharmacology": "Alectinib is a highly selective and potent ALK and RET tyrosine kinase inhibitor.In nonclinicalstudies, inhibition of ALK tyrosine kinase activity led to blockage of downstream signaling pathways including STAT 3 and PI3K/AKT and inducedtumor cell death (apoptosis). Alectinib demonstratedin vitroand in vivoactivity against mutant forms of the ALK enzyme, including mutations responsible forresistance to crizotinib.The major metabolite of alectinib (M4) has shown similar in vitropotency and activity. Based on nonclinicaldata, alectinib is not a substrate of p-glycoprotein (P-gp) or breast cancer resistance protein (BCRP), which are both efflux transporters in the blood brain barrier, and is therefore able to distribute into and be retained within the central nervous system. Alectinibinducedtumor regressionin nonclinicalmousexenograft models, including antitumor activity in the brain, and prolonged survival inintracranial tumor animal models.",
            "Dosage": "The recommended dose of Alectinib is 600 mg (four 150 mg capsules) given orally, twice daily (total daily dose of 1200 mg). Patients with underlying severe hepatic impairment should receive a dose of 450 mg given orally twice daily (total daily dose of 900 mg). Alectinib hard capsules should be taken with food, swallowed whole and must not be opened or dissolved.",
            "Administration": "Duration of Treatment: It is recommended that patients are treated with Alectinib until disease progression or unmanageable toxicity.Dose Modifications: Management of adverse events may require temporary interruption, dosereduction, or discontinuation of treatment with Alectinib. The dose of Alectinib should be reduced in steps of 150 mg twice daily based on tolerability. Alectinib treatment should be permanently discontinued if patients are unable to tolerate the 300 mg twice-daily dose.",
            "Interaction": "In vitro studies indicate that neither alectinib nor its major active metabolite (M4) inhibits CYP1A2, CYP2B6, CYP2C9, CYP2C19, or CYP2D6 at clinically relevant concentrations. Alectinib and M4 show weak time-dependent inhibition of CYP3A4. In vitro, alectinib exhibits a weak induction potential of CYP3A4 and CYP2B6 at clinical concentrations. Results from a clinical drug-drug interaction study in ALK-positive NSCLC patients demonstrated that multiple doses of alectinib had no influence on the exposure of midazolam, a sensitive CYP3A substrate. Therefore, no dose adjustment is required for co-administered CYP3A substrates. Although in vitro studies indicate that alectinib is an inhibitor of CYP2C8, physiologically based pharmacokinetic (PBPK) modeling supports that at clinically relevant concentrations alectinib does not have the potential to increase plasma concentrations of co-administered substrates of CYP2C8.",
            "Contraindications": "Alectinib is contraindicated in patients with a known hypersensitivity to alectinib or any of the excipients.",
            "Side Effects": "The most common adverse drug reactions were constipation, edema including peripheral, generalized, eyelid, periorbital; myalgia (31% including myalgia and musculoskeletal pain), nausea, increased bilirubin (21% including increased blood bilirubin, hyperbilirubinemia and increased bilirubin conjugated), anemia (20%, including anemia and hemoglobin decreased), and rash (20%, including rash, rash maculopapular, dermatitis acneiform, erythema, rash generalized, rash papular, rash pruritic and rash macular).",
            "Pregnancy & Lactation": "Pregnancy: Women of childbearing potential must be advised to avoid pregnancy while on Alectinib. No clinical studies of Alectinib in pregnant women have been performed. Based on its mechanism of action, Alectinib may cause fetal harm when administered to a pregnant woman. Female patients or women who are partners of male patients receiving Alectinib, who become pregnant while taking Alectinib or during the 3 months following the last dose of Alectinib must contact their doctor and should be advised of the potential harm to the fetus.Lactation: It is not known whether Alectinib is excreted in human breast milk. No studies have been conducted to assess the impact of Alectinib on milk production or its presence in breast milk. As many drugs are excreted in human milk and because of the potential harm to the infant, mothers should be advised against breastfeeding while receiving Alectinib.Contraception: Female patients of child-bearing potential, or women of child-bearing potential who are partners of male patients receiving Alectinib, must use highly effective contraceptive methods during treatment and for at least 3 months following the last dose of Alectinib",
            "Precautions & Warnings": "Interstitial lung disease (ILD)/pneumonitis: Cases of ILD/pneumonitishave been reported in clinical trials with Alectinib. Patients should be monitored for pulmonary symptoms indicative of pneumonitis. Alectinib should be immediately interrupted in patients diagnosed with ILD/pneumonitis and should be permanently discontinued if no other potential causes of ILD/pneumonitis have been identifiedHepatotoxicity: Elevations in alanine amino transferase (ALT) and aspartate amino transferase (AST) greater than 5 times the upper limit of normal (ULN) as well as bilirubin elevations of more than 3 times the ULN occurred in patients in pivotal clinical trials with Alectinib. The majority of these events occurred during the first 3months of treatment. In the pivotal Alectinib clinical trials it was reported that three patients with Grade 3‒4 AST/ALT elevations had drug-induced liver injury. Concurrent elevations in ALT or AST greater than or equal to three times the ULN and total bilirubin greater than or equal to two times the ULN, with normal alkaline phosphatase, occurred in 1 patient treated in Alectinib clinical trials.",
            "Use in Special Populations": "Pediatric use: The safety and efficacy of alectinib in children and adolescents (<18 years) have not been studied.Geriatric use: No dose adjustment of alectinib is required in patients≥65 years of age.Renal impairment: No dose adjustment is required in patients with mild or moderate renal impairment. alectinib has not been studied in patients with severe renal impairment, however,since alectinib elimination via the kidney is negligible, no dose adjustment is required inpatients with severe renal impairment Hepatic impairment: No dose adjustment is required in patients with underlying mild or moderate hepatic impairment. Patients with underlying severe hepatic impairment should receive a dose of 450 mg given orally twice daily (total daily dose of 900 mg)",
            "Therapeutic Class": "Anti neoplastic preparations, Protein kinase inhibitor",
            "Storage Conditions": "Keep below 30°C temperature, away from light & moisture. Keep out of the reach of children."
        },
        {
            "name": "Alendronic acid",
            "link": "https://medex.com.bd/generics/30/alendronic-acid",
            "Indications": "Alendronic acid is indicated for the-\n\nTreatment of Osteoporosis in Postmenopausal Women: Alendronic acid is indicated for the treatment of osteoporosis in postmenopausal women. In postmenopausal women, Alendronic acid increases bone mass and reduces the incidence of fractures, including those of the hip and spine. ... Read moreAlendronic acid is indicated for the-\n\nTreatment of Osteoporosis in Postmenopausal Women: Alendronic acid is indicated for the treatment of osteoporosis in postmenopausal women. In postmenopausal women, Alendronic acid increases bone mass and reduces the incidence of fractures, including those of the hip and spine.\nPrevention of Osteoporosis in Postmenopausal Women: Alendronic acid is indicated for the prevention of postmenopausal osteoporosis.\nTreatment to Increase Bone Mass in Men with Osteoporosis: Alendronic acid is indicated for treatment to increase bone mass in men with osteoporosis.\nTreatment of Glucocorticoid-Induced Osteoporosis: Alendronic acid is indicated for the treatment of glucocorticoid-induced osteoporosis in men and women receiving glucocorticoids in a daily dosage equivalent to 7.5 mg or greater of prednisone and who have low bone mineral density.\nTreatment of Paget's Disease of Bone: Alendronic acid is indicated for the treatment of Paget’s disease of bone in men and women. Treatment is indicated in patients with Paget's disease of bone who have alkaline phosphatase at least two times the upper limit of normal, or those who are symptomatic, or those at risk for future complications from their disease.",
            "Pharmacology": "Alendronate is a bisphosphonate that binds to bone hydroxyapatite and specifically inhibits the activity of osteoclasts, the bone-resorbing cells. Alendronate reduces bone resorption with no direct effect on bone formation, although the latter process is ultimately reduced because bone resorption and formation are coupled during bone turnover.Animal studies have indicated the following mode of action. At the cellular level, alendronate shows preferential localization to sites of bone resorption, specifically under osteoclasts. The osteoclasts adhere normally to the bone surface but lack the ruffled border that is indicative of active resorption. Alendronate does not interfere with osteoclast recruitment or attachment, but it does inhibit osteoclast activity. Studies in mice on the localization of radioactive [3H] alendronate in bone showed about 10-fold higher uptake on osteoclast surfaces than on osteoblast surfaces. Bones examined 6 and 49 days after [3H] alendronate administration in rats and mice, respectively, showed that normal bone was formed on top of the alendronate, which was incorporated inside the matrix. While incorporated in bone matrix, alendronate is not pharmacologically active. Thus, alendronate must be continuously administered to suppress osteoclasts on newly formed resorption surfaces. Histomorphometry in baboons and rats showed that alendronate treatment reduces bone turnover (i.e., the number of sites at which bone is remodeled). In addition, bone formation exceeds bone resorption at these remodeling sites, leading to progressive gains in bone mass.",
            "Dosage & Administration": "Treatment of Osteoporosis in Postmenopausal Women: The recommended dosage is one 70 mg tablet once weekly or one bottle of 70 mg oral solution once weekly or one 10 mg tablet once daily.Prevention of Osteoporosis in Postmenopausal Women: The recommended dosage is one 35 mg tablet once weekly or one 5 mg tablet once daily.Treatment to Increase Bone Mass in Men with Osteoporosis: The recommended dosage is one 70 mg tablet once weekly or one bottle of 70 mg oral solution once weekly or one 10 mg tablet once daily.Treatment of Glucocorticoid-Induced Osteoporosis: The recommended dosage is one 5 mg tablet once daily, except for postmenopausal women not receiving estrogen, for whom the recommended dosage is one 10 mg tablet once daily.Treatment of Paget's Disease of Bone: The recommended treatment regimen is 40 mg once a day for six months.",
            "Interaction": "The incidence of upper gastrointestinal side effects are increased with the concomitant use of non-steroidal anti-inflammatory agents and aspirin. Absorption of Alendronate is reduced in the presence of antacids and calcium supplements.",
            "Contraindications": "Alendronic acid is contraindicated in patients with the following conditions:  \n\nAbnormalities of the esophagus which delay esophageal emptying such as stricture or achalasia.\nInability to stand or sit upright for at least 30 minutes.\nDo not administer Alendronic acid oral solution to patients at increased risk of aspiration.\nHypocalcemia.\nHypersensitivity to any component of this product. Hypersensitivity reactions including urticaria and angioedema have been reported.",
            "Side Effects": "The commonest symptomatic side effects are constipation, diarrhoea, oesophageal ulcer, flatulence, dysphagia, musculoskeletal pain, headache, rarely rash, erythema, transient decrease in serum calcium and phosphate, nausea, vomiting, peptic ulceration, hypersensitivity reactions including urticaria and angio-oedema.",
            "Pregnancy & Lactation": "Alendronic acid should not be given to pregnant women or nursing mother.",
            "Precautions & Warnings": "Upper Gastrointestinal Adverse Reactions can occur. Instruct patients to follow dosing instructions. Discontinue if new or worsening symptoms occur.\nHypocalcemia can worsen and must be corrected prior to use.\nSevere Bone, Joint, Muscle Pain may occur. Discontinue use if severe symptoms develop.\nOsteonecrosis of the Jaw has been reported.\nAtypical Femur Fractures have been reported. Patients with new thigh or groin pain should be evaluated to rule out an incomplete femoral fracture.",
            "Use in Special Populations": "Pediatric Use: Alendronic acid is not indicated for use in pediatric patients.Renal Impairment: Alendronic acid is not recommended for patients with creatinine clearance less than 35 mL/min. No dosage adjustment is necessary in patients with creatinine clearance values between 35-60 mL/min.Hepatic Impairment: As there is evidence that alendronate is not metabolized or excreted in the bile, no studies were conducted in patients with hepatic impairment. No dosage adjustment is necessary.",
            "Therapeutic Class": "Bisphosphonate preparations",
            "Storage Conditions": "Store in a well-closed container at room temperature, 15-30°C"
        },
        {
            "name": "Alendronic Acid + Vitamin D3",
            "link": "https://medex.com.bd/generics/37/alendronic-acid-vitamin-d3",
            "Indications": "Alendronic Acid & Vitamin D3 is indicated in:\n\nTreatment of osteoporosis in postmenopausal women.\nTreatment of osteoporosis in men.\nTreatment of osteoporosis as it increases the bone mass and reduces the incidence of fractures, including those of the hip and spine.",
            "Pharmacology": "Alendronate Sodium is a bisphosphonate that acts as a specific inhibitor of osteoclast mediated bone resorption. Alendronate is effective when administered at least 30 minutes before breakfast. It transiently distributes to soft tissues following administration but is then rapidly distributed to bone or excreted in the urine. Protein binding in human plasma is approximately 78%. There is no evidence that Alendronate is metabolised in animals or humans. At the cellular level, Alendronate shows preferential localization to sites of bone resorption, specially under osteoclasts. It inhibits osteoclast activity. In addition, bone formation exceeds bone resorption, leading to progressive gains in bone mass. Vitamin D is required for normal bone formation. Vitamin D insufficiency develops when both sunlight exposure and dietary intake are inadequate. Insufficiency is associated with negative calcium balance, increased parathyroid hormone levels, bone loss, and increased risk of skeletal fracture.",
            "Dosage": "Treatment of Osteoporosis in Postmenopausal Women: The recommended dosage is-\n\n70 mg alendronate and 2800 IU vitamin D3 or\n70 mg alendronate and 5600 IU vitamin D3 tablet once weekly.\nFor most osteoporotic women, the appropriate dose is 70 mg alendronate and 5600 IU vitamin D3 once weekly.\n\r\nTreatment to Increase Bone Mass in Men with Osteoporosis: The recommended dosage is-\n\n70 mg alendronate and 2800 IU vitamin D3 or\n70 mg alendronate and 5600 IU D3 tablet once weekly.\nFor most osteoporotic men, the appropriate dose is 70 mg alendronate and 5600 IU vitamin D3 once weekly.",
            "Administration": "To permit adequate absorption, Alendronate & Colecalciferol must be taken at least 30 minutes before the first food, beverage or medication of the day with plain water only. Other beverages (including mineral water), food and some medications are likely to reduce the absorption of Alendronate. To facilitate delivery to the stomach and thus to reduce the potential for esophageal irritation, Alendronate & Colecalciferol tablet should only be swallowed upon rising for the day with a full glass of water. Patients should not lie down for at least 30 minutes after taking Alendronate until after their first food of the day. Alendronate & Colecalciferol should not be taken at bed time.",
            "Interaction": "Calcium supplement, antacids and some oral medications will interfere with absorption of Alendronate if taken at the same time. Intravenous ranitidine makes the bioavailability of oral Alendronate double. Incidence of upper gastro-intestinal adverse events associated with NSAID and aspirin appears to be greater with concomitant administration of Alendronate. Mineral oils, orlistat, and bile acid sequestrants (e.g., cholestyramine, colestipol) may impair the absorption of vitamin D. Anticonvulsants, cimetidine, and thiazides may increase the catabolism of vitamin D.",
            "Contraindications": "Abnormalities of the esophagus which delay esophageal emptying, such as stricture or achalasia.\nInability to stand or sit upright for at least 30 minutes.\nHypersensitivity to any component of this product.\nHypocalcaemia.",
            "Side Effects": "Usually mild and generally do not require discontinuation of therapy. Side effects include esophageal reactions, abdominal pain and distension, diarrhoea or constipation, flatulence, musculoskeletal pain, headache, rash, erythema and transient decreases in serum calcium and phosphate.",
            "Pregnancy & Lactation": "Pregnancy category C. Overdoses of vitamin D have shown teratogenic effects in pregnant animals. Alendronic Acid & Vitamin D3 (Colecalciferol) should be used during pregnancy only if the potential benefit justifies the potential risk to the mother and fetus. Cholecalciferol and some of its active metabolites pass into breast milk. It is not known whether alendronate is excreted in human milk. Caution should be exercised when administered to lactating women.",
            "Precautions & Warnings": "Hypocalcaemia and other disturbances of mineral metabolism should be corrected before initiation of therapy. Alendronate can cause local irritation of the upper gastro-intestinal mucosa. Caution should be used when Alendronate is given to patients with active upper gastrointestinal problems such as dysphagia, esophageal disease, gastritis, duodenitis or ulcers. Patients should stop taking medicine and consult their physician if they develop esophageal diseases.",
            "Use in Special Populations": "Dosing in elderly and renal insufficiency: No dosage adjustment is necessary for the elderly or for patients with mild-to-moderate renal insufficiency (creatinine clearance 35 to 60 mL/min). Alendronic Acid + Vitamin D3 (Colecalciferol) is not recommended for patients with more severe renal insufficiency (creatinine clearance<35 mL/min) due to lack of experience.",
            "Overdose Effects": "Hypocalcemia, hypophosphatemia, and upper gastrointestinal adverse events, such as upset stomach, heartburn, esophagitis, gastritis, or ulcer, may result from oral overdosage.  Signs and symptoms of vitamin D toxicity include hypercalcemia, hypercalciuria, anorexia, nausea, vomiting, polyuria, polydipsia, weakness, and lethargy.",
            "Therapeutic Class": "Combined preparations: Inhibiting bone resorption",
            "Storage Conditions": "Store in a cool and dry place. Protect from light & moisture. Keep out of the reach of children."
        },
        {
            "name": "Alfacalcidol",
            "link": "https://medex.com.bd/generics/40/alfacalcidol",
            "Indications": "Alfacalcidol is indicated in:\n\nIt is used to increase the amount of vitamin D in your body. This often increases calcium levels as well which can help in treatment of certain illnesses.\nIn general this drug is used to treat diseases where the amount of calcium and phosphate (which is controlled by the level of vitamin D) in your body needs changing. ... Read moreAlfacalcidol is indicated in:\n\nIt is used to increase the amount of vitamin D in your body. This often increases calcium levels as well which can help in treatment of certain illnesses.\nIn general this drug is used to treat diseases where the amount of calcium and phosphate (which is controlled by the level of vitamin D) in your body needs changing.\nBenefits of being on this drug can include control of the levels of calcium and phosphate in your body.\nTreat and prevent bone conditions that are caused by kidney failure (osteodystrophy)\nTreat illnesses and abnormalities affecting the parathyroid glands which make a substance called the parathyroid hormone.\nCorrect low levels of calcium in the blood of newborn babies (hypocalcaemia)\nTreat the softening and deformity of the bones due to lack of calcium (rickets or osteomalacia)",
            "Pharmacology": "The first step involved in the activation of vitamin D3 is a 25-hydroxylation which is catalysed by the 25-hydroxylase in the liver and then by other enzymes. The mitochondrial sterol 27-hydroxylase catalyses the first reaction in the oxidation of the side chain of sterol intermediates. The active form of vitamin D3 (calcitriol) binds to intracellular receptors that then function as transcription factors to modulate gene expression. Like the receptors for other steroid hormones and thyroid hormones, the vitamin D receptor has hormone-binding and DNA-binding domains. The vitamin D receptor forms a complex with another intracellular receptor, the retinoid-X receptor, and that heterodimer is what binds to DNA. In most cases studied, the effect is to activate transcription, but situations are also known in which vitamin D suppresses transcription. Calcitriol increases the serum calcium concentrations by: increasing GI absorption of phosphorus and calcium, increasing osteoclastic resorption, and increasing distal renal tubular reabsorption of calcium. Calcitriol appears to promote intestinal absorption of calcium through binding to the vitamin D receptor in the mucosal cytoplasm of the intestine. Subsequently, calcium is absorbed through formation of a calcium-binding protein.",
            "Dosage": "Adults: The usual starting dose is 1 microgram each day. People usually take between 1 and 3 micrograms each day. Most people take between 0.25 and 1 microgram each day once the blood test results show the medicine is working.If you have very low levels of calcium in your blood, your doctor may prescribe between 3 and 5 microgram each day. Your doctor may prescribe another medicine called a calcium supplement to take as well as Alfacalcidol. This will help to keep the right amount of calcium level in your blood.Elderly: The usual starting dose is 0.5 microgram each day.Children: \n\nNewborn and premature babies: The usual starting dose is 0.05 to 0.1 microgram per kilogram of body weight each day. If the level of calcium in their blood is very low, up to 2 micrograms per kilogram of body weight may be needed each day. A dose of 0.1 microgram per kilogram body weight each day is used to stop low blood calcium levels in premature babies.\nChildren weighing less than 20 kilograms: The usual starting dose is 0.05 microgram per kilogram body weight each day.\nChildren weighing more than 20 kilograms: The usual starting dose is 1 microgram each day.",
            "Administration": "Should be taken with food.",
            "Interaction": "Thiazides may increase the risk of hypercalcaemia. Some antiepileptics e.g. carbamazepine, phenobarbital, phenytoin and primidone may increase vitamin D requirements. Rifampicin, isoniazid and corticosteroids may reduce the efficacy of vitamin D.",
            "Contraindications": "Hypercalcaemia, metastatic calcification, hyperphosphataemia (except when occurring with hypoparathyroidism), hypermagnesaemia.",
            "Side Effects": "Anorexia, nausea, vomiting, diarrhoea, lassitude, polyuria, sweating, headache, thirst, vertigo, pruritus, rash, urticaria. Hypercalcaemia, hypercalciuria and ectopic calcification.In case of renal impairment, hyperphosphataemia. In hypercalcaemic dialysis patients, possibility of calcium influx from the dialysate should be considered.",
            "Pregnancy & Lactation": "FDA has not yet classified the drug into a specified pregnancy category.",
            "Precautions & Warnings": "Pregnancy, lactation, renal impairment, infants, elderly. Monitor serum levels of calcium in patients with renal failure. Caution in hypercalciuria in those with history of renal calculi. Avoid in patients with hypersensitivity to inj. containing propylene glycol.",
            "Therapeutic Class": "Vitamin in bone formation, Vitamin-D preparations",
            "Storage Conditions": "Keep below 30°C temperature, away from light & moisture. Keep out of the reach of children."
        },
        {
            "name": "Alfuzosin Hydrochloride",
            "link": "https://medex.com.bd/generics/41/alfuzosin-hydrochloride",
            "Indications": "Alfuzosin Hydrochloride is indicated for the treatment of the signs and symptoms of benign prostatic hyperplasia(BPH), lower urinary tract symptoms (LUTS) including urinary frequency, nocturia, incomplete emptying and urinary hesitancy associated with BPH.",
            "Pharmacology": "Alfuzosin Hydrochloride is a selective antagonist of post-synaptic a1 adrenoreceptors, which are located in the prostate, bladder base, bladder neck, prostatic capsule, and prostatic urethra. Alfuzosin Hydrochloride relaxes the tone of the prostate smooth muscle, prostate capsule, bladder neck and proximal urethra. It competitively and selectively binds to the post synaptic a1-adrenergic receptors in the lower urinary tract. It also relaxes sympathetic nervous stimulation, reduces resting urethral pressure and inhibits urethral hypertonia-induced sympathetic nervous stimulation. As an uroselective agent, Alfuzosin Hydrochloride preferentially binds to prostatic a1 receptors, blockage of these receptors result in reduction of BPH symptoms, improvement of urine flow and decreased potential for hypertensive events.",
            "Dosage": "Benign prostatic hyperplasia (BPH): The recommended dose is 10 mg to be taken once daily after a meal. Acute urinary retention (AUR): In patients 65 years and older, 10 mg  daily after a meal to be taken from the first day of catheterisation. The treatment should be administered for 3-4 days, 2-3 days during catheterisation and 1 day after its removal. In this indication no benefit has been established in patients under 65 years of age or if treatment is extended beyond 4 days.",
            "Administration": "Alfuzosin Hydrochloride tablet should be swallowed whole.",
            "Interaction": "Combinations contra-indicated: Alpha-1-receptor blockers. Combinations to be taken into account: Antihypertensive drugs, nitrates, potent CYP3A4 inhibitors such as ketoconazole, itraconazole and ritonavir. Repeated 200mg daily dosing of ketoconazole, for seven days resulted in a 2.1-fold increase in Cmax and a 2.5-fold increase in exposure of Alfuzosin Hydrochloride 10mg when administered as a single dose under fed conditions (high fat meal). Other parameters such as tmax and t1/2 were not modified. Cmax and AUC of Alfuzosin Hydrochloride 10mg, when administered as a single dose under fed conditions, increased 2.3- fold and 3.0- fold, respectively following 8-day repeated 400mg ketoconazole daily dosing. The administration of general anaesthetics to patients receiving Alfuzosin Hydrochloride could cause profound hypotension. It is recommended that the tablets be withdrawn 24 hours before surgery.Other forms of interaction: No pharmacodynamic or pharmacokinetic interaction has been observed in healthy volunteers between Alfuzosin Hydrochloride and the following drugs: warfarin, digoxin, hydrochlorothiazide and atenolol.",
            "Contraindications": "As with all alpha-1-blockers in some subjects, in particular patients receiving antihypertensive medications or nitrates, postural hypotension with or without symptoms (dizziness, fatigue, sweating) may develop within a few hours following administration. In such cases, the patient should lie down until the symptoms have completely disappeared. These effects are transient, occur at the beginning of treatment and do not usually prevent the continuation of treatment. The patient should be warned of the possible occurrence of such events. As with all alpha1-receptor blockers, Alfuzosin Hydrochloride should be used with caution in patients with acute cardiac failure. Care should be taken when Alfuzosin Hydrochloride is administered to patients who have had a pronounced hypotensive response to another alpha-1-blocker. Treatment should be initiated gradually in patients with hypersensitivity to alpha-1-blockers. Alfuzosin Hydrochloride should be administered carefully to patients being treated with antihypertensives. Blood pressure should be monitored regularly, especially at the beginning of treatment. Patients with congenital QTc prolongation, with a known history of acquired QTc prolongation or who are taking drugs known to increase the QTc interval should be evaluated before and during the administration of Alfuzosin Hydrochloride. In coronary patients, the specific treatment for coronary insufficiency should be continued. If angina pectoris reappears or worsens Alfuzosin Hydrochloride should be discontinued.  As there are no clinical safety data available in patients with severe renal impairment (creatinine clearance < 30ml/min), Alfuzosin Hydrochloride 10mg prolonged released tablets should not be administered to this patient group. Patients should be warned that the tablet should be swallowed whole. Any other mode of administration, such as crunching, crushing, chewing, grinding or pounding to powder should be prohibited. These actions may lead to inappropriate release and absorption of the drug and therefore possible early adverse reactions. The ‘Intraoperative Floppy Iris Syndrome’ (IFIS, a variant of small pupil syndrome) has been observed during cataract surgery in some patients on or previously treated with alpha-1-blockers. Although the risk of this event with Alfuzosin Hydrochloride appears very low, ophthalmic surgeons should be informed in advance of cataract surgery of current or past use of alpha-1-blockers, as IFIS may lead to increased procedural complications. The ophthalmologists should be prepared for possible modifications to their surgical technique. Alfuzosin Hydrochloride 10mg prolonged release tablets contain hydrogenated castor oil which may cause stomach upset and diarrhoea.",
            "Side Effects": "Classification of expected frequencies: Very common (<1/10), common (<1/100 to <1/10), uncommon (<1/1,000 to <1/100), rare (<1/10,000 to <1/1,000), very rare (<1/10,000), not known (cannot be estimated from the available data). Within each frequency grouping, undesirable effects are presented in order of decreasing seriousness. Nervous system disorders: Common: faintness/dizziness, headache; Uncommon: syncope, vertigo, malaise, drowsiness. Eye disorders: Uncommon: vision abnormal; Not known: intraoperative floppy iris syndrome. Cardiac disorders: Uncommon: tachycardia, palpitations, hypotension (postural); Very rare: New onset, aggravation or recurrence of angina pectoris in patients with pre-existing coronary artery disease; Not known: atrial fibrillation. Vascular disorders: Uncommon: hypotension (postural), flushing. Blood and lymphatic system disorders: Not known: neutropenia, thrombocytopenia. Respiratory, thoracic and mediastinal disorders: Uncommon: rhinitis. Gastro-intestinal disorders: Common: nausea, abdominal pain; Uncommon: diarrhoea, dry mouth, vomiting; Not known: vomiting. Hepatobiliary disorders: Frequency unknown: hepatocellular injury, cholestatic liver disease. Skin and subcutaneous tissue disorders: Uncommon: rash, pruritus; Very rare: urticaria, angioedema. Reproductive system and breast disorders: Frequency unknown: priapism. General disorders and administration site conditions: Common: asthenia; Uncommon: flushes, oedema, chest pain.",
            "Pregnancy & Lactation": "Due to the type of indication this is not applicable.",
            "Precautions & Warnings": "The administration of general anesthetics to patients receiving Alfuzosin could cause profound hypotension. It is recommended that the tablets be withdrawn 24 hours before surgery. If symptoms of angina pectoris start or get worse, taking Alfuzosin should be stopped.",
            "Use in Special Populations": "Paediatric Population: Efficacy of Alfuzosin Hydrochloride has not been demonstrated in children aged 2 to 16 years. Therefore Alfuzosin Hydrochloride is not indicated for use in the paediatric population.",
            "Overdose Effects": "In case of overdosage, the patient should be hospitalised, kept in the supine position, and conventional treatment of hypotension should take place. In case of significant hypotension, the appropriate corrective treatment may be a vasoconstrictor that acts directly on vascular muscle fibres.",
            "Therapeutic Class": "BPH/ Urinary retention/ Urinary incontinence",
            "Storage Conditions": "Store in a cool and dry place, protected from light"
        },
        {
            "name": "Allium cepa + Heparin + Allantoin",
            "link": "https://medex.com.bd/generics/2031/allium-cepa-heparin-allantoin",
            "Indications": "This gel is indicated for the following scar treatment:\n\nhypertrophic and keloid scars\nscar that occurs after surgery\nscar that occurs after amputation, burns and trauma\nscar due to traumatic tendon contracture",
            "Pharmacology": "Extract of Allium cepa: It is derived from the membrane of Allium cepa (onion membrane). It shows antiphlogistic efects through inhibition of infammatory mediators’ secretion and anti-allergenic efect. Extract of Allium cepa inhibits growth of fbroblast of diferent origin, particularly kelloidal fbroblasts. It has also bactericidal efect. While these properties stimulate primary wound healing, it prevents non-physiological scar formation.Heparin: In case of local application, it shows inhibitory efect on fbroblast proliferation. While heparin increases tissue hydration, it reduces irritation resulted from induration and infammation.Allantoin: Allantoin stimulates cellular proliferation. It also supports the development of healthy cells. Allantoin is convenient substance for the treatment of scar through its properties of stimulating epithelization and providing elastic surface formation.Clinical studies:\n\nEvaluation of the use of Extract of Allium cepa, Heparin & Allantoin gel for the prevention of scar formation: Total 1,268 patients were evaluated and after 2 to 3 months of treatment with Extract of Allium cepa, Heparin & Allantoin gel, a reduction of 31.5% in mean scar width and 47.8% reduction of mean scar height at the end of the observation period.\nAssessment of the use of Extract of Allium cepa, Allantoin, and Heparin in the early treatment of C-section scars: A total of 61 females, aged ≥18 years, who had given birth by C-section were evaluated. After six weeks of treatment, the gel showed signifcant improvement of the color, stifness and irregularity of C-section scars.",
            "Dosage & Administration": "This gel should be applied 3-4 times a day to the affected area and massaged gently in order to achieve better penetration. Continue with a circular motion until the gel is completely absorbed. Treatment may take several weeks or months depending on the size of existing scars and contracture.This gel is very safe and its tolerability has been proven in numerous clinical studies. Small children and even babies can be treated safely.",
            "Interaction": "There is no known and reported drug interaction.",
            "Contraindications": "This gel should not be used in patients with known hypersensitivity to any of its ingredients.",
            "Side Effects": "This gel is generally well tolerated even in long-term use. In rare cases, some local irritations are reported such as slight erythema and itching. These side effects do not require discontinuation of the treatment.",
            "Pregnancy & Lactation": "There are no studies conducted during pregnancy and lactation periods. Therefore it should be used with caution.",
            "Precautions & Warnings": "During treatment of fresh scars with this preparation, excess cold, UV lights and abrupt massage should be avoided. Avoid contact with eyes, the inside of the nose or mouth and other mucous membranes.",
            "Storage Conditions": "Store in a cool and dry place, below 25°C. Protect from direct sunlight and moisture. Do not freeze. Keep the medicine out of the reach of children."
        },
        {
            "name": "Allopurinol",
            "link": "https://medex.com.bd/generics/17/allopurinol",
            "Indications": "Allopurinol is indicated for reducing urate/uric acid formation in conditions where urate/uric acid deposition has already occurred (e.g. gouty arthritis, skin tophi, nephrolithiasis). Allopurinol is indicated for management of 2,8-dihydroxyadenine (2,8-DHA) renal stones related to deficient activity ... Read moreAllopurinol is indicated for reducing urate/uric acid formation in conditions where urate/uric acid deposition has already occurred (e.g. gouty arthritis, skin tophi, nephrolithiasis). Allopurinol is indicated for management of 2,8-dihydroxyadenine (2,8-DHA) renal stones related to deficient activity of adenine phospho ribosyltransferase. Allopurinol is indicated for the management of recurrent mixed calcium oxalate renal stones in the presence of hyperuricosuria, when fluid, dietary and similar measures have failed.",
            "Pharmacology": "Allopurinol is a xanthine oxidase inhibitor which is administered orally. It acts on purine catabolism without disrupting the biosynthesis of purines. It reduces the production of uric acid by inhibiting the biochemical reactions immediately preceding its formation. Allopurinol is a structural analogue of the natural purine base, hypoxanthine. It is an inhibitor of xanthine oxidase, the enzyme responsible for the conversion of hypoxanthine to xanthine and xanthine to uric acid, the end product of purine metabolism. Allopurinol is approximately 90% absorbed from the GI tract. Peak plasma levels generally occur at 1.5 hours to 4.5 hours. It has a plasma half life of about 1 to 2 hours. Approximately 20% of the ingested Allopurinol is excreted in the faeces.",
            "Dosage & Administration": "Adults: Allopurinol should be introduced at low dosage e.g. 100mg/day to reduce the risk of adverse reactions and increased only if the serum urate response is unsatisfactory. Extra caution should be exercised if renal function is poor. The following dosage schedules are suggested: 100 to 200 mg daily in mild conditions, 300 to 600 mg daily in moderately severe conditions, 700 to 900 mg daily in severe conditions.Children: Children under 15 years: 10 to 20 mg/kg body weight/day up to a maximum of 400 mg daily. Use in children is rarely indicated, except in malignant conditions (especially leukaemia) and certain enzyme disorders such as Lesch-Nyhan syndrome.Elderly: In the absence of specific data, the lowest dosage which produces satisfactory urate reduction should be used.Dosage in renal impairment: In severe renal insufficiency, it may be advisable to use less than 100 mg per day or to use single doses of 100mg at longer intervals than one day.",
            "Interaction": "When 6-mercaptopurine or azathioprine is given concurrently with Allopurinol, only one-quarter of the usual dose of 6- mercaptopurine or azathioprine should be given because inhibition of xanthine oxidase will prolong their activity. Evidence suggests that the plasma half-life of vidarabine is increased in the presence of allopurinol. When the two products are used concomitantly extra vigilance is necessary, to recognise enhanced toxic effects. Theophylline levels should be monitored in patients starting or increasing allopurinol therapy. An increase in frequency of skin rash has been reported among patients receiving ampicillin or amoxicillin concurrently with allopurinol compared to patients who are not receiving both drugs. Reports suggest that the plasma concentration of ciclosporin may be increased during concomitant treatment with allopurinol.",
            "Contraindications": "Allopurinol tablet is contra-indicated in patients with known hypersensitive to allopurinol.",
            "Side Effects": "Rashes, gastro intestinal disorder’s, rearly malaise, headache, vertigo, drowsiness, visual and test disturbances, hypertension, alopecia, hepatotoxicity, neuropathy, gynaeconastia and blood disorders.",
            "Pregnancy & Lactation": "There is inadequate evidence of safety of Allopurinol in human pregnancy. Use in pregnancy only when there is no safer alternative and when the disease itself carries risk for the mother or unborn child. There are no data concerning the effects of allopurinol or its metabolites on the breast-feed baby.",
            "Precautions & Warnings": "Allopurinol should be withdrawn immediately when a skin rash or other evidence of sensitivity occurs. Reduced doses should be used in patients with hepatic or renal impairment. Patients under treatment for hypertension or cardiac insufficiency may have some concomitant impairment of renal function and allopurinol should be used with care in this group.",
            "Overdose Effects": "Ingestion of up to 22.5 g allopurinol without adverse effect has been reported. Symptoms and signs including nausea, vomiting, diarrhoea and dizziness have been reported in a patient who ingested 20 gm allopurinol. Adequate hydration to maintain optimum diuresis facilitates excretion of allopurinol and its metabolites. If considered necessary haemodialysis may be used.",
            "Therapeutic Class": "Drugs used in Gout",
            "Storage Conditions": "Store in a cool and dry place, protected from light."
        }
    ]
]